STMicroelectronics/X-CUBE-NFC4/Drivers/CMSIS/Device/ST/STM32MP1xx/Include/stm32mp1xxxxx.h
#if defined (STM32MP157Cxx) || defined (STM32MP157Fxx) || defined (STM32MP157Axx) || defined (STM32MP157Dxx)
/**
  * @brief GPU host interface registers
  */
typedef struct
{
  __IO uint32_t CLKCTRLR;     /*!< Clock control register                           Address offset: 0x00 */
  __IO uint32_t IDLESR;       /*!< IDLE status register                             Address offset: 0x04 */
  __IO uint32_t AXICFGR;      /*!< AXI Configuration register                       Address offset: 0x08 */
  __IO uint32_t AXISR;        /*!< AXI Status register,                             Address offset: 0x0C */
  __IO uint32_t INTRACK;      /*!< Interrupt acknowledge register,                  Address offset: 0x10 */
  __IO uint32_t INTREN;       /*!< Interrupt enable register,                       Address offset: 0x14 */
  __IO uint32_t CHIPID;       /*!< Chip ID,                                         Address offset: 0x18 */
  __IO uint32_t CHIPREV;      /*!< Chip revision register,                          Address offset: 0x1C */
  __IO uint32_t CHIPDATE;     /*!< Release date register,                           Address offset: 0x20 */
  __IO uint32_t CHIPTIME;     /*!< Release Time register,                           Address offset: 0x24 */
  __IO uint32_t TOTALCYCLES;  /*!< Total number of Cycles register,                 Address offset: 0x28 */
  __IO uint32_t PRODUCTID;    /*!< Product ID register,                             Address offset: 0x2C */
  __IO uint32_t POWERCTRLR;   /*!< Power control register,                          Address offset: 0x30 */
  __IO uint32_t MMUCTRLR;     /*!< MMU control register,                            Address offset: 0x34 */
  __IO uint32_t MEMDEBUG;     /*!< Memory debug register,                           Address offset: 0x38 */
  __IO uint32_t CMDBUFADDR;   /*!< Command buffer base address register,            Address offset: 0x3C */
  __IO uint32_t CMDBUFCTRL;   /*!< Command buffer control register,                 Address offset: 0x40 */
} GPU_Host_InterfaceTypeDef;
/**
  * @}
  */
#endif /* #if defined (STM32MP157Cxx) || defined (STM32MP157Fxx) || defined (STM32MP157Axx) || defined (STM32MP157Dxx) */


/** @addtogroup Peripheral_memory_map
  * @{
  */
#if defined(CORE_CA7)
#define MCU_AHB_SRAM            ((uint32_t)0x30000000) /*!< Base address of : (up to 288KB) system data RAM accessible over over AHB             */
#define MCU_AHB_RETRAM          ((uint32_t)0x38000000) /*!< Base address of : (up to 64KB) Retention RAM accessible over over AHB                */
#else
#define MCU_AHB_SRAM            ((uint32_t)0x10000000) /*!< Base address of : (up to 288KB) system data RAM accessible over over AHB             */
#define MCU_AHB_RETRAM          ((uint32_t)0x00000000) /*!< Base address of : (up to 64KB) Retention RAM accessible over over AHB                */
#endif

#define SYSRAM_BASE             ((uint32_t)0x2FFC0000) /*!< Base address of : (up to 256KB) System RAM accessible over over AXI                  */
#define RETRAM_BASE             MCU_AHB_RETRAM
#define SRAM_BASE               MCU_AHB_SRAM
#define PERIPH_BASE             ((uint32_t)0x40000000) /*!< Base address of : AHB/ABP Peripherals                                                */
#define MPU_AXI_BUS_MEMORY_BASE ((uint32_t)0x60000000) /*!< Base address of : AXI Bus                                                            */

#define FMC_NOR_MEM_BASE        (MPU_AXI_BUS_MEMORY_BASE)              /*!< Base address of : FMC NOR memories  accessible over AXI              */
#define QSPI_MEM_BASE           (MPU_AXI_BUS_MEMORY_BASE + 0x10000000) /*!< Base address of : QSPI memories  accessible over AXI                 */
#define FMC_NAND_MEM_BASE       (MPU_AXI_BUS_MEMORY_BASE + 0x20000000) /*!< Base address of : FMC NAND memories  accessible over AXI             */
#define STM_DATA_BASE           (MPU_AXI_BUS_MEMORY_BASE + 0x30000000) /*!< Base address of : STM Data accessible over AXI                       */
#define DRAM_MEM_BASE           (MPU_AXI_BUS_MEMORY_BASE + 0x60000000) /*!< Base address of : DRAM (DDR) over AXI                                */

/*!< Device electronic signature memory map */
#define UID_BASE                  (0x5C005234L)            /*!< Unique Device ID register base address */
#define PACKAGE_BASE              (0x5C005240L)            /*!< Package Data register base address */
#define RPN_BASE                  (0x5C005204L)            /*!< Device Part Number register base address */
#define DV_BASE                   (0x50081000L)            /*!< Device Version register base address */

/*!< Peripheral memory map */
#define MCU_APB1_PERIPH_BASE        (PERIPH_BASE + 0x00000000)
#define MCU_APB2_PERIPH_BASE        (PERIPH_BASE + 0x04000000)
#define MCU_AHB2_PERIPH_BASE        (PERIPH_BASE + 0x08000000)
#define MCU_AHB3_PERIPH_BASE        (PERIPH_BASE + 0x0C000000)
#define MCU_AHB4_PERIPH_BASE        (PERIPH_BASE + 0x10000000)
#define MCU_APB3_PERIPH_BASE        (PERIPH_BASE + 0x10020000)
#define APB_DEBUG_PERIPH_BASE       (PERIPH_BASE + 0x10080000)
#define MPU_AHB5_PERIPH_BASE        (PERIPH_BASE + 0x14000000)
#define GPV_PERIPH_BASE             (PERIPH_BASE + 0x17000000)
#define MPU_AHB6_PERIPH_BASE        (PERIPH_BASE + 0x18000000)
#define MPU_APB4_PERIPH_BASE        (PERIPH_BASE + 0x1A000000)
#define MPU_APB5_PERIPH_BASE        (PERIPH_BASE + 0x1C000000)


/*!< MCU_APB1 */
#define TIM2_BASE             (MCU_APB1_PERIPH_BASE + 0x0000)
#define TIM3_BASE             (MCU_APB1_PERIPH_BASE + 0x1000)
#define TIM4_BASE             (MCU_APB1_PERIPH_BASE + 0x2000)
#define TIM5_BASE             (MCU_APB1_PERIPH_BASE + 0x3000)
#define TIM6_BASE             (MCU_APB1_PERIPH_BASE + 0x4000)
#define TIM7_BASE             (MCU_APB1_PERIPH_BASE + 0x5000)
#define TIM12_BASE            (MCU_APB1_PERIPH_BASE + 0x6000)
#define TIM13_BASE            (MCU_APB1_PERIPH_BASE + 0x7000)
#define TIM14_BASE            (MCU_APB1_PERIPH_BASE + 0x8000)
#define LPTIM1_BASE           (MCU_APB1_PERIPH_BASE + 0x9000)
#define WWDG1_BASE            (MCU_APB1_PERIPH_BASE + 0xA000)
#define SPI2_BASE             (MCU_APB1_PERIPH_BASE + 0xB000)
#define SPI3_BASE             (MCU_APB1_PERIPH_BASE + 0xC000)
#define SPDIFRX_BASE          (MCU_APB1_PERIPH_BASE + 0xD000)
#define USART2_BASE           (MCU_APB1_PERIPH_BASE + 0xE000)
#define USART3_BASE           (MCU_APB1_PERIPH_BASE + 0xF000)
#define UART4_BASE            (MCU_APB1_PERIPH_BASE + 0x10000)
#define UART5_BASE            (MCU_APB1_PERIPH_BASE + 0x11000)
#define I2C1_BASE             (MCU_APB1_PERIPH_BASE + 0x12000)
#define I2C2_BASE             (MCU_APB1_PERIPH_BASE + 0x13000)
#define I2C3_BASE             (MCU_APB1_PERIPH_BASE + 0x14000)
#define I2C5_BASE             (MCU_APB1_PERIPH_BASE + 0x15000)
#define CEC_BASE              (MCU_APB1_PERIPH_BASE + 0x16000)
#define DAC1_BASE             (MCU_APB1_PERIPH_BASE + 0x17000)
#define UART7_BASE            (MCU_APB1_PERIPH_BASE + 0x18000)
#define UART8_BASE            (MCU_APB1_PERIPH_BASE + 0x19000)
#define MDIOS_BASE            (MCU_APB1_PERIPH_BASE + 0x1C000)

