STMicroelectronics/X-CUBE-NFC4/Drivers/CMSIS/Device/ST/STM32MP1xx/Include/stm32mp1xxxxx.h
/*!< MCU_APB2 */
#define TIM1_BASE             (MCU_APB2_PERIPH_BASE + 0x0000)
#define TIM8_BASE             (MCU_APB2_PERIPH_BASE + 0x1000)
#define USART6_BASE           (MCU_APB2_PERIPH_BASE + 0x3000)
#define SPI1_BASE             (MCU_APB2_PERIPH_BASE + 0x4000)
#define SPI4_BASE             (MCU_APB2_PERIPH_BASE + 0x5000)
#define TIM15_BASE            (MCU_APB2_PERIPH_BASE + 0x6000)
#define TIM16_BASE            (MCU_APB2_PERIPH_BASE + 0x7000)
#define TIM17_BASE            (MCU_APB2_PERIPH_BASE + 0x8000)
#define SPI5_BASE             (MCU_APB2_PERIPH_BASE + 0x9000)
#define SAI1_BASE             (MCU_APB2_PERIPH_BASE + 0xA000)
#define SAI1_Block_A_BASE     (SAI1_BASE + 0x004)
#define SAI1_Block_B_BASE     (SAI1_BASE + 0x024)
#define SAI2_BASE             (MCU_APB2_PERIPH_BASE + 0xB000)
#define SAI2_Block_A_BASE     (SAI2_BASE + 0x004)
#define SAI2_Block_B_BASE     (SAI2_BASE + 0x024)
#define SAI3_BASE             (MCU_APB2_PERIPH_BASE + 0xC000)
#define SAI3_Block_A_BASE     (SAI3_BASE + 0x004)
#define SAI3_Block_B_BASE     (SAI3_BASE + 0x024)
#define DFSDM1_BASE           (MCU_APB2_PERIPH_BASE + 0xD000)
#define DFSDM1_Channel0_BASE  (DFSDM1_BASE + 0x00)
#define DFSDM1_Channel1_BASE  (DFSDM1_BASE + 0x20)
#define DFSDM1_Channel2_BASE  (DFSDM1_BASE + 0x40)
#define DFSDM1_Channel3_BASE  (DFSDM1_BASE + 0x60)
#define DFSDM1_Channel4_BASE  (DFSDM1_BASE + 0x80)
#define DFSDM1_Channel5_BASE  (DFSDM1_BASE + 0xA0)
#define DFSDM1_Channel6_BASE  (DFSDM1_BASE + 0xC0)
#define DFSDM1_Channel7_BASE  (DFSDM1_BASE + 0xE0)
#define DFSDM1_Filter0_BASE   (DFSDM1_BASE + 0x100)
#define DFSDM1_Filter1_BASE   (DFSDM1_BASE + 0x180)
#define DFSDM1_Filter2_BASE   (DFSDM1_BASE + 0x200)
#define DFSDM1_Filter3_BASE   (DFSDM1_BASE + 0x280)
#define DFSDM1_Filter4_BASE   (DFSDM1_BASE + 0x300)
#define DFSDM1_Filter5_BASE   (DFSDM1_BASE + 0x380)
#if defined (STM32MP157Cxx) || defined (STM32MP157Fxx) || defined (STM32MP157Axx) || defined (STM32MP157Dxx) || defined (STM32MP153Cxx) || defined (STM32MP153Fxx) || defined (STM32MP153Axx) || defined (STM32MP153Dxx)
#define FDCAN1_BASE           (MCU_APB2_PERIPH_BASE + 0xE000)
#define FDCAN2_BASE           (MCU_APB2_PERIPH_BASE + 0xF000)
#define TTFDCAN1_BASE         (MCU_APB2_PERIPH_BASE + 0xE100)
#define FDCAN_CCU_BASE (MCU_APB2_PERIPH_BASE + 0x10000)
#define SRAMCAN_BASE          (MCU_APB2_PERIPH_BASE + 0x11000)
#endif

/*!< MCU_AHB2 */
#define DMA1_BASE             (MCU_AHB2_PERIPH_BASE + 0x0000)
#define DMA2_BASE             (MCU_AHB2_PERIPH_BASE + 0x1000)
#define DMAMUX1_BASE          (MCU_AHB2_PERIPH_BASE + 0x2000)
#define ADC1_BASE             (MCU_AHB2_PERIPH_BASE + 0x3000)
#define ADC2_BASE             (MCU_AHB2_PERIPH_BASE + 0x3100)
#define ADC12_COMMON_BASE     (MCU_AHB2_PERIPH_BASE + 0x3300)
#define SDMMC3_BASE           (MCU_AHB2_PERIPH_BASE + 0x4000)
#define DLYB_SDMMC3_BASE          (MCU_AHB2_PERIPH_BASE + 0x5000)
#define USBOTG_BASE           (MCU_AHB2_PERIPH_BASE + 0x1000000)


/*!< MCU_AHB3 */
#define HSEM_BASE             (MCU_AHB3_PERIPH_BASE + 0x0000)
#define IPCC_BASE             (MCU_AHB3_PERIPH_BASE + 0x1000)
#define HASH2_BASE            (MCU_AHB3_PERIPH_BASE + 0x2000)
#define HASH2_DIGEST_BASE     (MCU_AHB3_PERIPH_BASE + 0x2310)
#define RNG2_BASE             (MCU_AHB3_PERIPH_BASE + 0x3000)
#define CRC2_BASE             (MCU_AHB3_PERIPH_BASE + 0x4000)
#if defined (STM32MP157Cxx) || defined (STM32MP157Fxx) || defined (STM32MP153Cxx) || defined (STM32MP153Fxx) || defined (STM32MP151Cxx) || defined (STM32MP151Fxx)
#define CRYP2_BASE            (MCU_AHB3_PERIPH_BASE + 0x5000)
#endif
#define DCMI_BASE             (MCU_AHB3_PERIPH_BASE + 0x6000)

/*!< MCU_AHB4 */
#define RCC_BASE              (MCU_AHB4_PERIPH_BASE + 0x0000)
#define PWR_BASE              (MCU_AHB4_PERIPH_BASE + 0x1000)
#define GPIOA_BASE            (MCU_AHB4_PERIPH_BASE + 0x2000)
#define GPIOB_BASE            (MCU_AHB4_PERIPH_BASE + 0x3000)
#define GPIOC_BASE            (MCU_AHB4_PERIPH_BASE + 0x4000)
#define GPIOD_BASE            (MCU_AHB4_PERIPH_BASE + 0x5000)
#define GPIOE_BASE            (MCU_AHB4_PERIPH_BASE + 0x6000)
#define GPIOF_BASE            (MCU_AHB4_PERIPH_BASE + 0x7000)
#define GPIOG_BASE            (MCU_AHB4_PERIPH_BASE + 0x8000)
#define GPIOH_BASE            (MCU_AHB4_PERIPH_BASE + 0x9000)
#define GPIOI_BASE            (MCU_AHB4_PERIPH_BASE + 0xA000)
#define GPIOJ_BASE            (MCU_AHB4_PERIPH_BASE + 0xB000)
#define GPIOK_BASE            (MCU_AHB4_PERIPH_BASE + 0xC000)
#define AIEC_BASE             (MCU_AHB4_PERIPH_BASE + 0xD000)
#define AIEC_C1_BASE          (AIEC_BASE + 0x0080)
#define AIEC_C2_BASE          (AIEC_BASE + 0x00C0)
/* Alias EXTI_BASE defined because HAL code not yet reworked with new name AIEC*/
#define EXTI_BASE             AIEC_BASE
#define EXTI_C1_BASE          AIEC_C1_BASE
#define EXTI_C2_BASE          AIEC_C2_BASE


/*!< MCU_APB3 */
#define SYSCFG_BASE           (MCU_APB3_PERIPH_BASE + 0x0000)
#define LPTIM2_BASE           (MCU_APB3_PERIPH_BASE + 0x1000)
#define LPTIM3_BASE           (MCU_APB3_PERIPH_BASE + 0x2000)
#define LPTIM4_BASE           (MCU_APB3_PERIPH_BASE + 0x3000)
#define LPTIM5_BASE           (MCU_APB3_PERIPH_BASE + 0x4000)
#define VREFBUF_BASE          (MCU_APB3_PERIPH_BASE + 0x5000)
#define SAI4_BASE             (MCU_APB3_PERIPH_BASE + 0x7000)
#define SAI4_Block_A_BASE     (SAI4_BASE + 0x004)
#define SAI4_Block_B_BASE     (SAI4_BASE + 0x024)
#define DTS_BASE              (MCU_APB3_PERIPH_BASE + 0x8000)
#define PMB_BASE              (MCU_APB3_PERIPH_BASE + 0x9000)
#define HDP_BASE              (MCU_APB3_PERIPH_BASE + 0xA000)

/*!< MCU_AHB4 _APB_Debug */
#define DBGMCU_BASE           ((uint32_t )0x50081000)

/*!< MCU_AHB5 */
#define BKPSRAM_BASE          (MPU_AHB5_PERIPH_BASE + 0x0000)
#if defined (STM32MP157Cxx) || defined (STM32MP157Fxx) || defined (STM32MP153Cxx) || defined (STM32MP153Fxx) || defined (STM32MP151Cxx) || defined (STM32MP151Fxx)
#define CRYP1_BASE            (MPU_AHB5_PERIPH_BASE + 0x1000)
#endif
#define HASH1_BASE            (MPU_AHB5_PERIPH_BASE + 0x2000)
#define HASH1_DIGEST_BASE     (MPU_AHB5_PERIPH_BASE + 0x2310)
#define RNG1_BASE             (MPU_AHB5_PERIPH_BASE + 0x3000)
#define GPIOZ_BASE            (MPU_AHB5_PERIPH_BASE + 0x4000)

/*!< GPV */

/*!< MPU_AHB6 */
#define MDMA_BASE               (MPU_AHB6_PERIPH_BASE + 0x0000)
#define FMC_R_BASE              (MPU_AHB6_PERIPH_BASE + 0x2000)
#define QSPI_R_BASE             (MPU_AHB6_PERIPH_BASE + 0x3000)
#define DLYB_QSPI_BASE          (MPU_AHB6_PERIPH_BASE + 0x4000)
#define SDMMC1_BASE             (MPU_AHB6_PERIPH_BASE + 0x5000)
#define DLYB_SDMMC1_BASE        (MPU_AHB6_PERIPH_BASE + 0x6000)
#define SDMMC2_BASE             (MPU_AHB6_PERIPH_BASE + 0x7000)
#define DLYB_SDMMC2_BASE        (MPU_AHB6_PERIPH_BASE + 0x8000)
#define CRC1_BASE               (MPU_AHB6_PERIPH_BASE + 0x9000)
#define ETH_BASE                (MPU_AHB6_PERIPH_BASE + 0xA000)
#define ETH_MAC_BASE            (ETH_BASE)
#define USB1HSFSP2_BASE         (MPU_AHB6_PERIPH_BASE + 0xC000)
#define USB1HSFSP1_BASE         (MPU_AHB6_PERIPH_BASE + 0xD000)
#if defined (STM32MP157Cxx) || defined (STM32MP157Fxx) || defined (STM32MP157Axx) || defined (STM32MP157Dxx)
#define GPU_BASE                (MPU_AHB6_PERIPH_BASE + 0x1000000)
#endif

/*!< MPU_APB4 */
#if defined (STM32MP157Cxx) || defined (STM32MP157Fxx) || defined (STM32MP157Axx) || defined (STM32MP157Dxx)
#define DSI_BASE              (MPU_APB4_PERIPH_BASE + 0x0000)
#endif
#define LTDC_BASE             (MPU_APB4_PERIPH_BASE + 0x1000)
#define LTDC_Layer1_BASE      (LTDC_BASE + 0x84)
#define LTDC_Layer2_BASE      (LTDC_BASE + 0x104)
#define IWDG2_BASE            (MPU_APB4_PERIPH_BASE + 0x2000)
#define DDRC_BASE             (MPU_APB4_PERIPH_BASE + 0x3000)
#define DDRPHYC_BASE          (MPU_APB4_PERIPH_BASE + 0x4000)
#define STGENR_BASE           (MPU_APB4_PERIPH_BASE + 0x5000)
#define USBPHYC_BASE          (MPU_APB4_PERIPH_BASE + 0x6000)
#define USBPHYC_PHY1_BASE     (USBPHYC_BASE + 0x100)
#define USBPHYC_PHY2_BASE     (USBPHYC_BASE + 0x200)

/*!< MPU_APB5 */
#define USART1_BASE           (MPU_APB5_PERIPH_BASE + 0x0000)
#define SPI6_BASE             (MPU_APB5_PERIPH_BASE + 0x1000)
#define I2C4_BASE             (MPU_APB5_PERIPH_BASE + 0x2000)
#define IWDG1_BASE            (MPU_APB5_PERIPH_BASE + 0x3000)
#define RTC_BASE              (MPU_APB5_PERIPH_BASE + 0x4000)
#define BSEC_BASE             (MPU_APB5_PERIPH_BASE + 0x5000)
#define TZC_BASE              (MPU_APB5_PERIPH_BASE + 0x6000)
#define TZPC_BASE             (MPU_APB5_PERIPH_BASE + 0x7000)
#define STGENC_BASE           (MPU_APB5_PERIPH_BASE + 0x8000)
#define I2C6_BASE             (MPU_APB5_PERIPH_BASE + 0x9000)
#define TAMP_BASE             (MPU_APB5_PERIPH_BASE + 0xA000)



/*!< USB registers base address */
#define USB_OTG_GLOBAL_BASE                  ((uint32_t )0x000)
#define USB_OTG_DEVICE_BASE                  ((uint32_t )0x800)
#define USB_OTG_IN_ENDPOINT_BASE             ((uint32_t )0x900)
#define USB_OTG_OUT_ENDPOINT_BASE            ((uint32_t )0xB00)
#define USB_OTG_EP_REG_SIZE                  ((uint32_t )0x20)
#define USB_OTG_HOST_BASE                    ((uint32_t )0x400)
#define USB_OTG_HOST_PORT_BASE               ((uint32_t )0x440)
#define USB_OTG_HOST_CHANNEL_BASE            ((uint32_t )0x500)
#define USB_OTG_HOST_CHANNEL_SIZE            ((uint32_t )0x20)
#define USB_OTG_PCGCCTL_BASE                 ((uint32_t )0xE00)
#define USB_OTG_FIFO_BASE                    ((uint32_t )0x1000)
#define USB_OTG_FIFO_SIZE                    ((uint32_t )0x1000)



#define DMA1_Stream0_BASE     (DMA1_BASE + 0x010)
#define DMA1_Stream1_BASE     (DMA1_BASE + 0x028)
#define DMA1_Stream2_BASE     (DMA1_BASE + 0x040)
#define DMA1_Stream3_BASE     (DMA1_BASE + 0x058)
#define DMA1_Stream4_BASE     (DMA1_BASE + 0x070)
#define DMA1_Stream5_BASE     (DMA1_BASE + 0x088)
#define DMA1_Stream6_BASE     (DMA1_BASE + 0x0A0)
#define DMA1_Stream7_BASE     (DMA1_BASE + 0x0B8)

#define DMA2_Stream0_BASE     (DMA2_BASE + 0x010)
#define DMA2_Stream1_BASE     (DMA2_BASE + 0x028)
#define DMA2_Stream2_BASE     (DMA2_BASE + 0x040)
#define DMA2_Stream3_BASE     (DMA2_BASE + 0x058)
#define DMA2_Stream4_BASE     (DMA2_BASE + 0x070)
#define DMA2_Stream5_BASE     (DMA2_BASE + 0x088)
#define DMA2_Stream6_BASE     (DMA2_BASE + 0x0A0)
#define DMA2_Stream7_BASE     (DMA2_BASE + 0x0B8)

