STMicroelectronics/X-CUBE-NFC4/Drivers/CMSIS/Device/ST/STM32MP1xx/Include/stm32mp1xxxxx.h
#define RCC_MP_RSTSSETR_MCSYSRSTF_Pos         (7U)
#define RCC_MP_RSTSSETR_MCSYSRSTF_Msk         (0x1U << RCC_MP_RSTSSETR_MCSYSRSTF_Pos) /*!< 0x00000080 */
#define RCC_MP_RSTSSETR_MCSYSRSTF             RCC_MP_RSTSSETR_MCSYSRSTF_Msk           /*MCU System reset flag*/

#define RCC_MP_RSTSSETR_IWDG1RSTF_Pos         (8U)
#define RCC_MP_RSTSSETR_IWDG1RSTF_Msk         (0x1U << RCC_MP_RSTSSETR_IWDG1RSTF_Pos) /*!< 0x00000100 */
#define RCC_MP_RSTSSETR_IWDG1RSTF             RCC_MP_RSTSSETR_IWDG1RSTF_Msk           /*IWDG1 reset flag*/

#define RCC_MP_RSTSSETR_IWDG2RSTF_Pos         (9U)
#define RCC_MP_RSTSSETR_IWDG2RSTF_Msk         (0x1U << RCC_MP_RSTSSETR_IWDG2RSTF_Pos) /*!< 0x00000200 */
#define RCC_MP_RSTSSETR_IWDG2RSTF             RCC_MP_RSTSSETR_IWDG2RSTF_Msk           /*IWDG2 reset flag*/

#define RCC_MP_RSTSSETR_STDBYRSTF_Pos         (11U)
#define RCC_MP_RSTSSETR_STDBYRSTF_Msk         (0x1U << RCC_MP_RSTSSETR_STDBYRSTF_Pos) /*!< 0x00000800 */
#define RCC_MP_RSTSSETR_STDBYRSTF             RCC_MP_RSTSSETR_STDBYRSTF_Msk           /*System Standby reset flag*/

#define RCC_MP_RSTSSETR_CSTDBYRSTF_Pos        (12U)
#define RCC_MP_RSTSSETR_CSTDBYRSTF_Msk        (0x1U << RCC_MP_RSTSSETR_CSTDBYRSTF_Pos) /*!< 0x00001000 */
#define RCC_MP_RSTSSETR_CSTDBYRSTF            RCC_MP_RSTSSETR_CSTDBYRSTF_Msk           /*MPU CStandby reset flag*/

#define RCC_MP_RSTSSETR_MPUP0RSTF_Pos         (13U)
#define RCC_MP_RSTSSETR_MPUP0RSTF_Msk         (0x1U << RCC_MP_RSTSSETR_MPUP0RSTF_Pos) /*!< 0x00002000 */
#define RCC_MP_RSTSSETR_MPUP0RSTF             RCC_MP_RSTSSETR_MPUP0RSTF_Msk           /*MPU processor 0 reset flag*/

#define RCC_MP_RSTSSETR_MPUP1RSTF_Pos         (14U)
#define RCC_MP_RSTSSETR_MPUP1RSTF_Msk         (0x1U << RCC_MP_RSTSSETR_MPUP1RSTF_Pos) /*!< 0x00004000 */
#define RCC_MP_RSTSSETR_MPUP1RSTF             RCC_MP_RSTSSETR_MPUP1RSTF_Msk           /*MPU processor 1 reset flag*/

#define RCC_MP_RSTSSETR_SPARE_Pos             (15U)
#define RCC_MP_RSTSSETR_SPARE_Msk             (0x1U << RCC_MP_RSTSSETR_SPARE_Pos)     /*!< 0x00008000 */
#define RCC_MP_RSTSSETR_SPARE                 RCC_MP_RSTSSETR_SPARE_Msk               /*Spare bits*/

/*******************  Bit definition for RCC_APB1RSTSETR register  ************/
/*!< This register is used to activate the reset of the corresponding peripheral */
#define RCC_APB1RSTSETR_TIM2RST               B(0)
#define RCC_APB1RSTSETR_TIM3RST               B(1)
#define RCC_APB1RSTSETR_TIM4RST               B(2)
#define RCC_APB1RSTSETR_TIM5RST               B(3)
#define RCC_APB1RSTSETR_TIM6RST               B(4)
#define RCC_APB1RSTSETR_TIM7RST               B(5)
#define RCC_APB1RSTSETR_TIM12RST              B(6)
#define RCC_APB1RSTSETR_TIM13RST              B(7)
#define RCC_APB1RSTSETR_TIM14RST              B(8)
#define RCC_APB1RSTSETR_LPTIM1RST             B(9)
#define RCC_APB1RSTSETR_SPI2RST               B(11)
#define RCC_APB1RSTSETR_SPI3RST               B(12)
#define RCC_APB1RSTSETR_USART2RST             B(14)
#define RCC_APB1RSTSETR_USART3RST             B(15)
#define RCC_APB1RSTSETR_UART4RST              B(16)
#define RCC_APB1RSTSETR_UART5RST              B(17)
#define RCC_APB1RSTSETR_UART7RST              B(18)
#define RCC_APB1RSTSETR_UART8RST              B(19)
#define RCC_APB1RSTSETR_I2C1RST               B(21)
#define RCC_APB1RSTSETR_I2C2RST               B(22)
#define RCC_APB1RSTSETR_I2C3RST               B(23)
#define RCC_APB1RSTSETR_I2C5RST               B(24)
#define RCC_APB1RSTSETR_SPDIFRST              B(26)
#define RCC_APB1RSTSETR_CECRST                B(27)
#define RCC_APB1RSTSETR_DAC12RST              B(29)
#define RCC_APB1RSTSETR_MDIOSRST              B(31)

/*******************  Bit definition for RCC_APB1RSTCLRR register  ************/
/*!< This register is used to release the reset of the corresponding peripheral */
#define RCC_APB1RSTCLRR_TIM2RST               B(0)
#define RCC_APB1RSTCLRR_TIM3RST               B(1)
#define RCC_APB1RSTCLRR_TIM4RST               B(2)
#define RCC_APB1RSTCLRR_TIM5RST               B(3)
#define RCC_APB1RSTCLRR_TIM6RST               B(4)
#define RCC_APB1RSTCLRR_TIM7RST               B(5)
#define RCC_APB1RSTCLRR_TIM12RST              B(6)
#define RCC_APB1RSTCLRR_TIM13RST              B(7)
#define RCC_APB1RSTCLRR_TIM14RST              B(8)
#define RCC_APB1RSTCLRR_LPTIM1RST             B(9)
#define RCC_APB1RSTCLRR_SPI2RST               B(11)
#define RCC_APB1RSTCLRR_SPI3RST               B(12)
#define RCC_APB1RSTCLRR_USART2RST             B(14)
#define RCC_APB1RSTCLRR_USART3RST             B(15)
#define RCC_APB1RSTCLRR_UART4RST              B(16)
#define RCC_APB1RSTCLRR_UART5RST              B(17)
#define RCC_APB1RSTCLRR_UART7RST              B(18)
#define RCC_APB1RSTCLRR_UART8RST              B(19)
#define RCC_APB1RSTCLRR_I2C1RST               B(21)
#define RCC_APB1RSTCLRR_I2C2RST               B(22)
#define RCC_APB1RSTCLRR_I2C3RST               B(23)
#define RCC_APB1RSTCLRR_I2C5RST               B(24)
#define RCC_APB1RSTCLRR_SPDIFRST              B(26)
#define RCC_APB1RSTCLRR_CECRST                B(27)
#define RCC_APB1RSTCLRR_DAC12RST              B(29)
#define RCC_APB1RSTCLRR_MDIOSRST              B(31)

/*******************  Bit definition for RCC_APB2RSTSETR register  ************/
/*!< This register is used to activate the reset of the corresponding peripheral */
#define RCC_APB2RSTSETR_TIM1RST               B(0)
#define RCC_APB2RSTSETR_TIM8RST               B(1)
#define RCC_APB2RSTSETR_TIM15RST              B(2)
#define RCC_APB2RSTSETR_TIM16RST              B(3)
#define RCC_APB2RSTSETR_TIM17RST              B(4)
#define RCC_APB2RSTSETR_SPI1RST               B(8)
#define RCC_APB2RSTSETR_SPI4RST               B(9)
#define RCC_APB2RSTSETR_SPI5RST               B(10)
#define RCC_APB2RSTSETR_USART6RST             B(13)
#define RCC_APB2RSTSETR_SAI1RST               B(16)
#define RCC_APB2RSTSETR_SAI2RST               B(17)
#define RCC_APB2RSTSETR_SAI3RST               B(18)
#define RCC_APB2RSTSETR_DFSDMRST              B(20)
#if defined (STM32MP157Cxx) || defined (STM32MP157Fxx) || defined (STM32MP157Axx) || defined (STM32MP157Dxx) || defined (STM32MP153Cxx) || defined (STM32MP153Fxx) || defined (STM32MP153Axx) || defined (STM32MP153Dxx)
#define RCC_APB2RSTSETR_FDCANRST              B(24)
#endif

/*******************  Bit definition for RCC_APB2RSTCLRR register  ************/
/*!< This register is used to release the reset of the corresponding peripheral */
#define RCC_APB2RSTCLRR_TIM1RST               B(0)
#define RCC_APB2RSTCLRR_TIM8RST               B(1)
#define RCC_APB2RSTCLRR_TIM15RST              B(2)
#define RCC_APB2RSTCLRR_TIM16RST              B(3)
#define RCC_APB2RSTCLRR_TIM17RST              B(4)
#define RCC_APB2RSTCLRR_SPI1RST               B(8)
#define RCC_APB2RSTCLRR_SPI4RST               B(9)
#define RCC_APB2RSTCLRR_SPI5RST               B(10)
#define RCC_APB2RSTCLRR_USART6RST             B(13)
#define RCC_APB2RSTCLRR_SAI1RST               B(16)
#define RCC_APB2RSTCLRR_SAI2RST               B(17)
#define RCC_APB2RSTCLRR_SAI3RST               B(18)
#define RCC_APB2RSTCLRR_DFSDMRST              B(20)
#if defined (STM32MP157Cxx) || defined (STM32MP157Fxx) || defined (STM32MP157Axx) || defined (STM32MP157Dxx) || defined (STM32MP153Cxx) || defined (STM32MP153Fxx) || defined (STM32MP153Axx) || defined (STM32MP153Dxx)
#define RCC_APB2RSTCLRR_FDCANRST              B(24)
#endif

/*******************  Bit definition for RCC_APB3RSTSETR register  ************/
/*!< This register is used to activate the reset of the corresponding peripheral */
#define RCC_APB3RSTSETR_LPTIM2RST             B(0)
#define RCC_APB3RSTSETR_LPTIM3RST             B(1)
#define RCC_APB3RSTSETR_LPTIM4RST             B(2)
#define RCC_APB3RSTSETR_LPTIM5RST             B(3)
#define RCC_APB3RSTSETR_SAI4RST               B(8)
#define RCC_APB3RSTSETR_SYSCFGRST             B(11)
#define RCC_APB3RSTSETR_VREFRST               B(13)
#define RCC_APB3RSTSETR_DTSRST                B(16)
#define RCC_APB3RSTSETR_PMBCTRLRST            B(17)

