STMicroelectronics/X-CUBE-NFC4/Drivers/CMSIS/Device/ST/STM32MP1xx/Include/stm32mp1xxxxx.h
/*******************  Bit definition for RCC_APB3RSTCLRR register  ************/
/*!< This register is used to release the reset of the corresponding peripheral */
#define RCC_APB3RSTCLRR_LPTIM2RST             B(0)
#define RCC_APB3RSTCLRR_LPTIM3RST             B(1)
#define RCC_APB3RSTCLRR_LPTIM4RST             B(2)
#define RCC_APB3RSTCLRR_LPTIM5RST             B(3)
#define RCC_APB3RSTCLRR_SAI4RST               B(8)
#define RCC_APB3RSTCLRR_SYSCFGRST             B(11)
#define RCC_APB3RSTCLRR_VREFRST               B(13)
#define RCC_APB3RSTCLRR_DTSRST                B(16)
#define RCC_APB3RSTCLRR_PMBCTRLRST            B(17)

/*******************  Bit definition for RCC_AHB2RSTSETR register  ************/
/*!< This register is used to activate the reset of the corresponding peripheral */
#define RCC_AHB2RSTSETR_DMA1RST               B(0)
#define RCC_AHB2RSTSETR_DMA2RST               B(1)
#define RCC_AHB2RSTSETR_DMAMUXRST             B(2)
#define RCC_AHB2RSTSETR_ADC12RST              B(5)
#define RCC_AHB2RSTSETR_USBORST               B(8)
#define RCC_AHB2RSTSETR_SDMMC3RST             B(16)

/*******************  Bit definition for RCC_AHB2RSTCLRR register  ************/
/*!< This register is used to release the reset of the corresponding peripheral */
#define RCC_AHB2RSTCLRR_DMA1RST               B(0)
#define RCC_AHB2RSTCLRR_DMA2RST               B(1)
#define RCC_AHB2RSTCLRR_DMAMUXRST             B(2)
#define RCC_AHB2RSTCLRR_ADC12RST              B(5)
#define RCC_AHB2RSTCLRR_USBORST               B(8)
#define RCC_AHB2RSTCLRR_SDMMC3RST             B(16)

/*******************  Bit definition for RCC_AHB3RSTSETR register  ************/
/*!< This register is used to activate the reset of the corresponding peripheral */
#define RCC_AHB3RSTSETR_DCMIRST               B(0)
#if defined (STM32MP157Cxx) || defined (STM32MP157Fxx) || defined (STM32MP153Cxx) || defined (STM32MP153Fxx) || defined (STM32MP151Cxx) || defined (STM32MP151Fxx)
#define RCC_AHB3RSTSETR_CRYP2RST              B(4)
#endif
#define RCC_AHB3RSTSETR_HASH2RST              B(5)
#define RCC_AHB3RSTSETR_RNG2RST               B(6)
#define RCC_AHB3RSTSETR_CRC2RST               B(7)
#define RCC_AHB3RSTSETR_HSEMRST               B(11)
#define RCC_AHB3RSTSETR_IPCCRST               B(12)

/*******************  Bit definition for RCC_AHB3RSTCLRR register  ************/
/*!< This register is used to release the reset of the corresponding peripheral */
#define RCC_AHB3RSTCLRR_DCMIRST               B(0)
#if defined (STM32MP157Cxx) || defined (STM32MP157Fxx) || defined (STM32MP153Cxx) || defined (STM32MP153Fxx) || defined (STM32MP151Cxx) || defined (STM32MP151Fxx)
#define RCC_AHB3RSTCLRR_CRYP2RST              B(4)
#endif
#define RCC_AHB3RSTCLRR_HASH2RST              B(5)
#define RCC_AHB3RSTCLRR_RNG2RST               B(6)
#define RCC_AHB3RSTCLRR_CRC2RST               B(7)
#define RCC_AHB3RSTCLRR_HSEMRST               B(11)
#define RCC_AHB3RSTCLRR_IPCCRST               B(12)

/*******************  Bit definition for RCC_AHB4RSTSETR register  ************/
/*!< This register is used to activate the reset of the corresponding peripheral */
#define RCC_AHB4RSTSETR_GPIOARST              B(0)
#define RCC_AHB4RSTSETR_GPIOBRST              B(1)
#define RCC_AHB4RSTSETR_GPIOCRST              B(2)
#define RCC_AHB4RSTSETR_GPIODRST              B(3)
#define RCC_AHB4RSTSETR_GPIOERST              B(4)
#define RCC_AHB4RSTSETR_GPIOFRST              B(5)
#define RCC_AHB4RSTSETR_GPIOGRST              B(6)
#define RCC_AHB4RSTSETR_GPIOHRST              B(7)
#define RCC_AHB4RSTSETR_GPIOIRST              B(8)
#define RCC_AHB4RSTSETR_GPIOJRST              B(9)
#define RCC_AHB4RSTSETR_GPIOKRST              B(10)

/*******************  Bit definition for RCC_AHB4RSTCLRR register  ************/
/*!< This register is used to release the reset of the corresponding peripheral */
#define RCC_AHB4RSTCLRR_GPIOARST              B(0)
#define RCC_AHB4RSTCLRR_GPIOBRST              B(1)
#define RCC_AHB4RSTCLRR_GPIOCRST              B(2)
#define RCC_AHB4RSTCLRR_GPIODRST              B(3)
#define RCC_AHB4RSTCLRR_GPIOERST              B(4)
#define RCC_AHB4RSTCLRR_GPIOFRST              B(5)
#define RCC_AHB4RSTCLRR_GPIOGRST              B(6)
#define RCC_AHB4RSTCLRR_GPIOHRST              B(7)
#define RCC_AHB4RSTCLRR_GPIOIRST              B(8)
#define RCC_AHB4RSTCLRR_GPIOJRST              B(9)
#define RCC_AHB4RSTCLRR_GPIOKRST              B(10)

/*******************  Bit definition for RCC_APB4RSTSETR register  ************/
/*!< This register is used to activate the reset of the corresponding peripheral */
#define RCC_APB4RSTSETR_LTDCRST               B(0)
#if defined (STM32MP157Cxx) || defined (STM32MP157Fxx) || defined (STM32MP157Axx) || defined (STM32MP157Dxx)
#define RCC_APB4RSTSETR_DSIRST                B(4)
#endif
#define RCC_APB4RSTSETR_DDRPERFMRST           B(8)
#define RCC_APB4RSTSETR_USBPHYRST             B(16)

/*******************  Bit definition for RCC_APB4RSTCLRR register  ************/
/*!< This register is used to release the reset of the corresponding peripheral */
#define RCC_APB4RSTCLRR_LTDCRST               B(0)
#if defined (STM32MP157Cxx) || defined (STM32MP157Fxx) || defined (STM32MP157Axx) || defined (STM32MP157Dxx)
#define RCC_APB4RSTCLRR_DSIRST                B(4)
#endif
#define RCC_APB4RSTCLRR_DDRPERFMRST           B(8)
#define RCC_APB4RSTCLRR_USBPHYRST             B(16)

/*******************  Bit definition for RCC_APB5RSTSETR register  ************/
/*!< This register is used to activate the reset of the corresponding peripheral */
#define RCC_APB5RSTSETR_SPI6RST               B(0)
#define RCC_APB5RSTSETR_I2C4RST               B(2)
#define RCC_APB5RSTSETR_I2C6RST               B(3)
#define RCC_APB5RSTSETR_USART1RST             B(4)
#define RCC_APB5RSTSETR_STGENRST              B(20)

/*******************  Bit definition for RCC_APB5RSTCLRR register  ************/
/*!< This register is used to release the reset of the corresponding peripheral */
#define RCC_APB5RSTCLRR_SPI6RST               B(0)
#define RCC_APB5RSTCLRR_I2C4RST               B(2)
#define RCC_APB5RSTCLRR_I2C6RST               B(3)
#define RCC_APB5RSTCLRR_USART1RST             B(4)
#define RCC_APB5RSTCLRR_STGENRST              B(20)

/*******************  Bit definition for RCC_AHB5RSTSETR register  ************/
/*!< This register is used to activate the reset of the corresponding peripheral */
#define RCC_AHB5RSTSETR_GPIOZRST              B(0)
#if defined (STM32MP157Cxx) || defined (STM32MP157Fxx) || defined (STM32MP153Cxx) || defined (STM32MP153Fxx) || defined (STM32MP151Cxx) || defined (STM32MP151Fxx)
#define RCC_AHB5RSTSETR_CRYP1RST              B(4)
#endif
#define RCC_AHB5RSTSETR_HASH1RST              B(5)
#define RCC_AHB5RSTSETR_RNG1RST               B(6)
#define RCC_AHB5RSTSETR_AXIMCRST              B(16)

/*******************  Bit definition for RCC_AHB5RSTCLRR register  ************/
/*!< This register is used to release the reset of the corresponding peripheral */
#define RCC_AHB5RSTCLRR_GPIOZRST              B(0)
#if defined (STM32MP157Cxx) || defined (STM32MP157Fxx) || defined (STM32MP153Cxx) || defined (STM32MP153Fxx) || defined (STM32MP151Cxx) || defined (STM32MP151Fxx)
#define RCC_AHB5RSTCLRR_CRYP1RST              B(4)
#endif
#define RCC_AHB5RSTCLRR_HASH1RST              B(5)
#define RCC_AHB5RSTCLRR_RNG1RST               B(6)
#define RCC_AHB5RSTCLRR_AXIMCRST              B(16)

