STMicroelectronics/X-CUBE-NFC4/Drivers/CMSIS/Device/ST/STM32MP1xx/Include/stm32mp1xxxxx.h
/*******************  Bit definition for RCC_AHB6RSTSETR register  ************/
/*!< This register is used to activate the reset of the corresponding peripheral */
#if defined (STM32MP157Cxx) || defined (STM32MP157Fxx) || defined (STM32MP157Axx) || defined (STM32MP157Dxx)
#define RCC_AHB6RSTSETR_GPURST                B(5)
#endif
#define RCC_AHB6RSTSETR_ETHMACRST             B(10)
#define RCC_AHB6RSTSETR_FMCRST                B(12)
#define RCC_AHB6RSTSETR_QSPIRST               B(14)
#define RCC_AHB6RSTSETR_SDMMC1RST             B(16)
#define RCC_AHB6RSTSETR_SDMMC2RST             B(17)
#define RCC_AHB6RSTSETR_CRC1RST               B(20)
#define RCC_AHB6RSTSETR_USBHRST               B(24)

/*******************  Bit definition for RCC_AHB6RSTCLRR register  ************/
/*!< This register is used to release the reset of the corresponding peripheral */
#define RCC_AHB6RSTCLRR_ETHMACRST             B(10)
#define RCC_AHB6RSTCLRR_FMCRST                B(12)
#define RCC_AHB6RSTCLRR_QSPIRST               B(14)
#define RCC_AHB6RSTCLRR_SDMMC1RST             B(16)
#define RCC_AHB6RSTCLRR_SDMMC2RST             B(17)
#define RCC_AHB6RSTCLRR_CRC1RST               B(20)
#define RCC_AHB6RSTCLRR_USBHRST               B(24)

/*******************  Bit definition for RCC_TZAHB6RSTSETR register  ************/
/*!< This register is used to activate the reset of the corresponding peripheral */
#define RCC_TZAHB6RSTSETR_MDMARST             B(0)

/*******************  Bit definition for RCC_TZAHB6RSTCLRR register  ************/
/*!< This register is used to release the reset of the corresponding peripheral */
#define RCC_TZAHB6RSTCLRR_MDMARST             B(0)

/*******************  Bit definition for RCC_MP_GRSTCSETR register  ************/
/*!< This register is used by the MPU in order to generate either a MCU reset
 * or a system reset or a reset of one of the two MPU processors. Writing '0' has
 * no effect, reading will return the effective values of the corresponding bits.
 * Writing a '1' activates the reset */
#define RCC_MP_GRSTCSETR_MPSYSRST_Pos         (0U)
#define RCC_MP_GRSTCSETR_MPSYSRST_Msk         (0x1U << RCC_MP_GRSTCSETR_MPSYSRST_Pos) /*!< 0x00000001 */
#define RCC_MP_GRSTCSETR_MPSYSRST             RCC_MP_GRSTCSETR_MPSYSRST_Msk           /*System reset */
#define RCC_MP_GRSTCSETR_MCURST_Pos           (1U)
#define RCC_MP_GRSTCSETR_MCURST_Msk           (0x1U << RCC_MP_GRSTCSETR_MCURST_Pos)   /*!< 0x00000002 */
#define RCC_MP_GRSTCSETR_MCURST               RCC_MP_GRSTCSETR_MCURST_Msk             /*MCU reset */
#define RCC_MP_GRSTCSETR_MPUP0RST_Pos         (4U)
#define RCC_MP_GRSTCSETR_MPUP0RST_Msk         (0x1U << RCC_MP_GRSTCSETR_MPUP0RST_Pos) /*!< 0x00000010 */
#define RCC_MP_GRSTCSETR_MPUP0RST             RCC_MP_GRSTCSETR_MPUP0RST_Msk           /*MPU processor 0 reset*/
#define RCC_MP_GRSTCSETR_MPUP1RST_Pos         (5U)
#define RCC_MP_GRSTCSETR_MPUP1RST_Msk         (0x1U << RCC_MP_GRSTCSETR_MPUP1RST_Pos) /*!< 0x00000020 */
#define RCC_MP_GRSTCSETR_MPUP1RST             RCC_MP_GRSTCSETR_MPUP1RST_Msk           /*MPU processor 1 reset*/

/*******************  Bit definition for RCC_MC_APB1ENSETR register  ***********/
/*!<  This register is used to set the peripheral clock enable bit of the corresponding
 * peripheral to 1. It shall be used to allocate a peripheral to the MCU. */
#define RCC_MC_APB1ENSETR_TIM2EN              B(0)
#define RCC_MC_APB1ENSETR_TIM3EN              B(1)
#define RCC_MC_APB1ENSETR_TIM4EN              B(2)
#define RCC_MC_APB1ENSETR_TIM5EN              B(3)
#define RCC_MC_APB1ENSETR_TIM6EN              B(4)
#define RCC_MC_APB1ENSETR_TIM7EN              B(5)
#define RCC_MC_APB1ENSETR_TIM12EN             B(6)
#define RCC_MC_APB1ENSETR_TIM13EN             B(7)
#define RCC_MC_APB1ENSETR_TIM14EN             B(8)
#define RCC_MC_APB1ENSETR_LPTIM1EN            B(9)
#define RCC_MC_APB1ENSETR_SPI2EN              B(11)
#define RCC_MC_APB1ENSETR_SPI3EN              B(12)
#define RCC_MC_APB1ENSETR_USART2EN            B(14)
#define RCC_MC_APB1ENSETR_USART3EN            B(15)
#define RCC_MC_APB1ENSETR_UART4EN             B(16)
#define RCC_MC_APB1ENSETR_UART5EN             B(17)
#define RCC_MC_APB1ENSETR_UART7EN             B(18)
#define RCC_MC_APB1ENSETR_UART8EN             B(19)
#define RCC_MC_APB1ENSETR_I2C1EN              B(21)
#define RCC_MC_APB1ENSETR_I2C2EN              B(22)
#define RCC_MC_APB1ENSETR_I2C3EN              B(23)
#define RCC_MC_APB1ENSETR_I2C5EN              B(24)
#define RCC_MC_APB1ENSETR_SPDIFEN             B(26)
#define RCC_MC_APB1ENSETR_CECEN               B(27)
#define RCC_MC_APB1ENSETR_WWDG1EN             B(28)
#define RCC_MC_APB1ENSETR_DAC12EN             B(29)
#define RCC_MC_APB1ENSETR_MDIOSEN             B(31)

/*******************  Bit definition for RCC_MC_APB1ENCLRR register  ************/
/*!< This register is used to clear the peripheral clock enable bit of the corresponding
peripheral. It shall be used to deallocate a peripheral from MCU */
#define RCC_MC_APB1ENCLRR_TIM2EN              B(0)
#define RCC_MC_APB1ENCLRR_TIM3EN              B(1)
#define RCC_MC_APB1ENCLRR_TIM4EN              B(2)
#define RCC_MC_APB1ENCLRR_TIM5EN              B(3)
#define RCC_MC_APB1ENCLRR_TIM6EN              B(4)
#define RCC_MC_APB1ENCLRR_TIM7EN              B(5)
#define RCC_MC_APB1ENCLRR_TIM12EN             B(6)
#define RCC_MC_APB1ENCLRR_TIM13EN             B(7)
#define RCC_MC_APB1ENCLRR_TIM14EN             B(8)
#define RCC_MC_APB1ENCLRR_LPTIM1EN            B(9)
#define RCC_MC_APB1ENCLRR_SPI2EN              B(11)
#define RCC_MC_APB1ENCLRR_SPI3EN              B(12)
#define RCC_MC_APB1ENCLRR_USART2EN            B(14)
#define RCC_MC_APB1ENCLRR_USART3EN            B(15)
#define RCC_MC_APB1ENCLRR_UART4EN             B(16)
#define RCC_MC_APB1ENCLRR_UART5EN             B(17)
#define RCC_MC_APB1ENCLRR_UART7EN             B(18)
#define RCC_MC_APB1ENCLRR_UART8EN             B(19)
#define RCC_MC_APB1ENCLRR_I2C1EN              B(21)
#define RCC_MC_APB1ENCLRR_I2C2EN              B(22)
#define RCC_MC_APB1ENCLRR_I2C3EN              B(23)
#define RCC_MC_APB1ENCLRR_I2C5EN              B(24)
#define RCC_MC_APB1ENCLRR_SPDIFEN             B(26)
#define RCC_MC_APB1ENCLRR_CECEN               B(27)
#define RCC_MC_APB1ENCLRR_WWDG1EN             B(28)
#define RCC_MC_APB1ENCLRR_DAC12EN             B(29)
#define RCC_MC_APB1ENCLRR_MDIOSEN             B(31)

/*******************  Bit definition for RCC_MC_APB2ENSETR register  ***********/
/*!<  This register is used to set the peripheral clock enable bit of the corresponding
 * peripheral to 1.  It shall be used to allocate a peripheral to the MCU. */
#define RCC_MC_APB2ENSETR_TIM1EN              B(0)
#define RCC_MC_APB2ENSETR_TIM8EN              B(1)
#define RCC_MC_APB2ENSETR_TIM15EN             B(2)
#define RCC_MC_APB2ENSETR_TIM16EN             B(3)
#define RCC_MC_APB2ENSETR_TIM17EN             B(4)
#define RCC_MC_APB2ENSETR_SPI1EN              B(8)
#define RCC_MC_APB2ENSETR_SPI4EN              B(9)
#define RCC_MC_APB2ENSETR_SPI5EN              B(10)
#define RCC_MC_APB2ENSETR_USART6EN            B(13)
#define RCC_MC_APB2ENSETR_SAI1EN              B(16)
#define RCC_MC_APB2ENSETR_SAI2EN              B(17)
#define RCC_MC_APB2ENSETR_SAI3EN              B(18)
#define RCC_MC_APB2ENSETR_DFSDMEN             B(20)
#define RCC_MC_APB2ENSETR_ADFSDMEN            B(21)
#if defined (STM32MP157Cxx) || defined (STM32MP157Fxx) || defined (STM32MP157Axx) || defined (STM32MP157Dxx) || defined (STM32MP153Cxx) || defined (STM32MP153Fxx) || defined (STM32MP153Axx) || defined (STM32MP153Dxx)
#define RCC_MC_APB2ENSETR_FDCANEN             B(24)
#endif

/*******************  Bit definition for RCC_MC_APB2ENCLRR register  ************/
/*!< This register is used to clear the peripheral clock enable bit of the corresponding
 * peripheral. It shall be used to deallocate a peripheral from MCU */
#define RCC_MC_APB2ENCLRR_TIM1EN              B(0)
#define RCC_MC_APB2ENCLRR_TIM8EN              B(1)
#define RCC_MC_APB2ENCLRR_TIM15EN             B(2)
#define RCC_MC_APB2ENCLRR_TIM16EN             B(3)
#define RCC_MC_APB2ENCLRR_TIM17EN             B(4)
#define RCC_MC_APB2ENCLRR_SPI1EN              B(8)
#define RCC_MC_APB2ENCLRR_SPI4EN              B(9)
#define RCC_MC_APB2ENCLRR_SPI5EN              B(10)
#define RCC_MC_APB2ENCLRR_USART6EN            B(13)
#define RCC_MC_APB2ENCLRR_SAI1EN              B(16)
#define RCC_MC_APB2ENCLRR_SAI2EN              B(17)
#define RCC_MC_APB2ENCLRR_SAI3EN              B(18)
#define RCC_MC_APB2ENCLRR_DFSDMEN             B(20)
#define RCC_MC_APB2ENCLRR_ADFSDMEN            B(21)
#if defined (STM32MP157Cxx) || defined (STM32MP157Fxx) || defined (STM32MP157Axx) || defined (STM32MP157Dxx) || defined (STM32MP153Cxx) || defined (STM32MP153Fxx) || defined (STM32MP153Axx) || defined (STM32MP153Dxx)
#define RCC_MC_APB2ENCLRR_FDCANEN             B(24)
#endif

/*******************  Bit definition for RCC_MC_APB3ENSETR register  ***********/
/*!<  This register is used to set the peripheral clock enable bit of the corresponding
 * peripheral to 1.  It shall be used to allocate a peripheral to the MCU. */
#define RCC_MC_APB3ENSETR_LPTIM2EN            B(0)
#define RCC_MC_APB3ENSETR_LPTIM3EN            B(1)
#define RCC_MC_APB3ENSETR_LPTIM4EN            B(2)
#define RCC_MC_APB3ENSETR_LPTIM5EN            B(3)
#define RCC_MC_APB3ENSETR_SAI4EN              B(8)
#define RCC_MC_APB3ENSETR_SYSCFGEN            B(11)
#define RCC_MC_APB3ENSETR_VREFEN              B(13)
#define RCC_MC_APB3ENSETR_DTSEN               B(16)
#define RCC_MC_APB3ENSETR_PMBCTRLEN           B(17)
#define RCC_MC_APB3ENSETR_HDPEN               B(20)

