STMicroelectronics/X-CUBE-NFC4/Drivers/CMSIS/Device/ST/STM32MP1xx/Include/stm32mp1xxxxx.h
/*******************  Bit definition for RCC_MC_APB3ENCLRR register  ************/
/*!< This register is used to clear the peripheral clock enable bit of the corresponding
 * peripheral. It shall be used to deallocate a peripheral from MCU */
#define RCC_MC_APB3ENCLRR_LPTIM2EN            B(0)
#define RCC_MC_APB3ENCLRR_LPTIM3EN            B(1)
#define RCC_MC_APB3ENCLRR_LPTIM4EN            B(2)
#define RCC_MC_APB3ENCLRR_LPTIM5EN            B(3)
#define RCC_MC_APB3ENCLRR_SAI4EN              B(8)
#define RCC_MC_APB3ENCLRR_SYSCFGEN            B(11)
#define RCC_MC_APB3ENCLRR_VREFEN              B(13)
#define RCC_MC_APB3ENCLRR_DTSEN               B(16)
#define RCC_MC_APB3ENCLRR_PMBCTRLEN           B(17)
#define RCC_MC_APB3ENCLRR_HDPEN               B(20)

/*******************  Bit definition for RCC_MC_APB4ENSETR register  ***********/
/*!<  This register is used to set the peripheral clock enable bit of the corresponding
 * peripheral to 1.  It shall be used to allocate a peripheral to the MCU. */
#define RCC_MC_APB4ENSETR_LTDCEN              B(0)
#if defined (STM32MP157Cxx) || defined (STM32MP157Fxx) || defined (STM32MP157Axx) || defined (STM32MP157Dxx)
#define RCC_MC_APB4ENSETR_DSIEN               B(4)
#endif
#define RCC_MC_APB4ENSETR_DDRPERFMEN          B(8)
#define RCC_MC_APB4ENSETR_USBPHYEN            B(16)
#define RCC_MC_APB4ENSETR_STGENROEN           B(20)

/*******************  Bit definition for RCC_MP_APB4ENSETR register  ***********/
/*!<  This register is used to set the peripheral clock enable bit of the corresponding
 * peripheral to 1.  It shall be used to allocate a peripheral to the MPU. */
#define RCC_MP_APB4ENSETR_LTDCEN              B(0)
#if defined (STM32MP157Cxx) || defined (STM32MP157Fxx) || defined (STM32MP157Axx) || defined (STM32MP157Dxx)
#define RCC_MP_APB4ENSETR_DSIEN               B(4)
#endif
#define RCC_MP_APB4ENSETR_IWDG2APBEN          B(15)
#define RCC_MP_APB4ENSETR_USBPHYEN            B(16)
#define RCC_MP_APB4ENSETR_STGENROEN           B(20)

/*******************  Bit definition for RCC_MC_APB4ENCLRR register  ************/
/*!< This register is used to clear the peripheral clock enable bit of the corresponding
 * peripheral. It shall be used to deallocate a peripheral from MCU */
#define RCC_MC_APB4ENCLRR_LTDCEN              B(0)
#if defined (STM32MP157Cxx) || defined (STM32MP157Fxx) || defined (STM32MP157Axx) || defined (STM32MP157Dxx)
#define RCC_MC_APB4ENCLRR_DSIEN               B(4)
#endif
#define RCC_MC_APB4ENCLRR_USBPHYEN            B(16)
#define RCC_MC_APB4ENCLRR_STGENROEN           B(20)

/*******************  Bit definition for RCC_MP_APB4ENCLRR register  ************/
/*!< This register is used to clear the peripheral clock enable bit of the corresponding
 * peripheral. It shall be used to deallocate a peripheral from MCU */
#define RCC_MP_APB4ENCLRR_LTDCEN              B(0)
#if defined (STM32MP157Cxx) || defined (STM32MP157Fxx) || defined (STM32MP157Axx) || defined (STM32MP157Dxx)
#define RCC_MP_APB4ENCLRR_DSIEN               B(4)
#endif
#define RCC_MP_APB4ENCLRR_IWDG2APBEN          B(15)
#define RCC_MP_APB4ENCLRR_USBPHYEN            B(16)
#define RCC_MP_APB4ENCLRR_STGENROEN           B(20)

/*******************  Bit definition for RCC_MC_APB5ENSETR register  ***********/
/*!<  This register is used to set the peripheral clock enable bit of the corresponding
 * peripheral to 1.  It shall be used to allocate a peripheral to the MCU. */
#define RCC_MC_APB5ENSETR_SPI6EN              B(0)
#define RCC_MC_APB5ENSETR_I2C4EN              B(2)
#define RCC_MC_APB5ENSETR_I2C6EN              B(3)
#define RCC_MC_APB5ENSETR_USART1EN            B(4)
#define RCC_MC_APB5ENSETR_RTCAPBEN            B(8)
#define RCC_MC_APB5ENSETR_TZC1EN              B(11)
#define RCC_MC_APB5ENSETR_TZC2EN              B(12)
#define RCC_MC_APB5ENSETR_TZPCEN              B(13)
#define RCC_MC_APB5ENSETR_BSECEN              B(16)
#define RCC_MC_APB5ENSETR_STGENEN             B(20)

/*******************  Bit definition for RCC_MP_APB5ENSETR register  ***********/
/*!<  This register is used to set the peripheral clock enable bit of the corresponding
 * peripheral to 1.  It shall be used to allocate a peripheral to the MPU.
 * This bit can also be used to test if IWDG1 peripheral clock is enabled
 * If TZEN = 1, this register can only be modified in secure mode. */
#define RCC_MP_APB5ENSETR_IWDG1APBEN          B(15)

/*******************  Bit definition for RCC_MC_APB5ENCLRR register  ************/
/*!< This register is used to clear the peripheral clock enable bit of the corresponding
 * peripheral. It shall be used to deallocate a peripheral from MCU */
#define RCC_MC_APB5ENCLRR_SPI6EN              B(0)
#define RCC_MC_APB5ENCLRR_I2C4EN              B(2)
#define RCC_MC_APB5ENCLRR_I2C6EN              B(3)
#define RCC_MC_APB5ENCLRR_USART1EN            B(4)
#define RCC_MC_APB5ENCLRR_RTCAPBEN            B(8)
#define RCC_MC_APB5ENCLRR_TZC1EN              B(11)
#define RCC_MC_APB5ENCLRR_TZC2EN              B(12)
#define RCC_MC_APB5ENCLRR_TZPCEN              B(13)
#define RCC_MC_APB5ENCLRR_BSECEN              B(16)
#define RCC_MC_APB5ENCLRR_STGENEN             B(20)

/*******************  Bit definition for RCC_MC_AHB5ENSETR register  ***********/
/*!<  This register is used to set the peripheral clock enable bit of the corresponding
 * peripheral to 1.  It shall be used to allocate a peripheral to the MCU. */
#define RCC_MC_AHB5ENSETR_GPIOZEN             B(0)
#if defined (STM32MP157Cxx) || defined (STM32MP157Fxx) || defined (STM32MP153Cxx) || defined (STM32MP153Fxx) || defined (STM32MP151Cxx) || defined (STM32MP151Fxx)
#define RCC_MC_AHB5ENSETR_CRYP1EN             B(4)
#endif
#define RCC_MC_AHB5ENSETR_HASH1EN             B(5)
#define RCC_MC_AHB5ENSETR_RNG1EN              B(6)
#define RCC_MC_AHB5ENSETR_BKPSRAMEN           B(8)
#define RCC_MC_AHB5ENSETR_AXIMC               B(16)

/*******************  Bit definition for RCC_MC_AHB5ENCLRR register  ************/
/*!< This register is used to clear the peripheral clock enable bit of the corresponding
 * peripheral. It shall be used to deallocate a peripheral from MCU */
#define RCC_MC_AHB5ENCLRR_GPIOZEN             B(0)
#if defined (STM32MP157Cxx) || defined (STM32MP157Fxx) || defined (STM32MP153Cxx) || defined (STM32MP153Fxx) || defined (STM32MP151Cxx) || defined (STM32MP151Fxx)
#define RCC_MC_AHB5ENCLRR_CRYP1EN             B(4)
#endif
#define RCC_MC_AHB5ENCLRR_HASH1EN             B(5)
#define RCC_MC_AHB5ENCLRR_RNG1EN              B(6)
#define RCC_MC_AHB5ENCLRR_BKPSRAMEN           B(8)

/*******************  Bit definition for RCC_MC_AHB6ENSETR register  ***********/
/*!<  This register is used to set the peripheral clock enable bit of the corresponding
 * peripheral to 1.  It shall be used to allocate a peripheral to the MCU. */
#define RCC_MC_AHB6ENSETR_MDMAEN              B(0)
#if defined (STM32MP157Cxx) || defined (STM32MP157Fxx) || defined (STM32MP157Axx) || defined (STM32MP157Dxx)
#define RCC_MC_AHB6ENSETR_GPUEN               B(5)
#endif
#define RCC_MC_AHB6ENSETR_ETHCKEN             B(7)
#define RCC_MC_AHB6ENSETR_ETHTXEN             B(8)
#define RCC_MC_AHB6ENSETR_ETHRXEN             B(9)
#define RCC_MC_AHB6ENSETR_ETHMACEN            B(10)
#define RCC_MC_AHB6ENSETR_FMCEN               B(12)
#define RCC_MC_AHB6ENSETR_QSPIEN              B(14)
#define RCC_MC_AHB6ENSETR_SDMMC1EN            B(16)
#define RCC_MC_AHB6ENSETR_SDMMC2EN            B(17)
#define RCC_MC_AHB6ENSETR_CRC1EN              B(20)
#define RCC_MC_AHB6ENSETR_USBHEN              B(24)

/*******************  Bit definition for RCC_MC_AHB6ENCLRR register  ************/
/*!< This register is used to clear the peripheral clock enable bit of the corresponding
 * peripheral. It shall be used to deallocate a peripheral from MCU */
#define RCC_MC_AHB6ENCLRR_MDMAEN              B(0)
#if defined (STM32MP157Cxx) || defined (STM32MP157Fxx) || defined (STM32MP157Axx) || defined (STM32MP157Dxx)
#define RCC_MC_AHB6ENCLRR_GPUEN               B(5)
#endif
#define RCC_MC_AHB6ENCLRR_ETHCKEN             B(7)
#define RCC_MC_AHB6ENCLRR_ETHTXEN             B(8)
#define RCC_MC_AHB6ENCLRR_ETHRXEN             B(9)
#define RCC_MC_AHB6ENCLRR_ETHMACEN            B(10)
#define RCC_MC_AHB6ENCLRR_FMCEN               B(12)
#define RCC_MC_AHB6ENCLRR_QSPIEN              B(14)
#define RCC_MC_AHB6ENCLRR_SDMMC1EN            B(16)
#define RCC_MC_AHB6ENCLRR_SDMMC2EN            B(17)
#define RCC_MC_AHB6ENCLRR_CRC1EN              B(20)
#define RCC_MC_AHB6ENCLRR_USBHEN              B(24)

