STMicroelectronics/X-CUBE-NFC4/Drivers/CMSIS/Device/ST/STM32MP1xx/Include/stm32mp1xxxxx.h
/*******************  Bit definition for RCC_MP_TZAHB6ENSETR register  ***********/
/*!<  This register is used to set the peripheral clock enable bit of the corresponding
 * peripheral to 1.  It shall be used to allocate a peripheral to the MPU. */
#define RCC_MP_TZAHB6ENSETR_MDMAEN            B(0)

/*******************  Bit definition for RCC_MP_TZAHB6ENCLRR register  ************/
/*!< This register is used to clear the peripheral clock enable bit of the corresponding
 * peripheral. It shall be used to deallocate a peripheral from MPU */
#define RCC_MP_TZAHB6ENCLRR_MDMAEN            B(0)

/*******************  Bit definition for RCC_MC_AHB2ENSETR register  ***********/
/*!<  This register is used to set the peripheral clock enable bit of the corresponding
 * peripheral to 1.  It shall be used to allocate a peripheral to the MCU. */
#define RCC_MC_AHB2ENSETR_DMA1EN              B(0)
#define RCC_MC_AHB2ENSETR_DMA2EN              B(1)
#define RCC_MC_AHB2ENSETR_DMAMUXEN            B(2)
#define RCC_MC_AHB2ENSETR_ADC12EN             B(5)
#define RCC_MC_AHB2ENSETR_USBOEN              B(8)
#define RCC_MC_AHB2ENSETR_SDMMC3EN            B(16)

/*******************  Bit definition for RCC_MC_AHB2ENCLRR register  ************/
/*!< This register is used to clear the peripheral clock enable bit of the corresponding
 * peripheral. It shall be used to deallocate a peripheral from MCU */
#define RCC_MC_AHB2ENCLRR_DMA1EN              B(0)
#define RCC_MC_AHB2ENCLRR_DMA2EN              B(1)
#define RCC_MC_AHB2ENCLRR_DMAMUXEN            B(2)
#define RCC_MC_AHB2ENCLRR_ADC12EN             B(5)
#define RCC_MC_AHB2ENCLRR_USBOEN              B(8)
#define RCC_MC_AHB2ENCLRR_SDMMC3EN            B(16)

/*******************  Bit definition for RCC_MC_AHB3ENSETR register  ***********/
/*!<  This register is used to set the peripheral clock enable bit of the corresponding
 * peripheral to 1.  It shall be used to allocate a peripheral to the MCU. */
#define RCC_MC_AHB3ENSETR_DCMIEN              B(0)
#if defined (STM32MP157Cxx) || defined (STM32MP157Fxx) || defined (STM32MP153Cxx) || defined (STM32MP153Fxx) || defined (STM32MP151Cxx) || defined (STM32MP151Fxx)
#define RCC_MC_AHB3ENSETR_CRYP2EN             B(4)
#endif
#define RCC_MC_AHB3ENSETR_HASH2EN             B(5)
#define RCC_MC_AHB3ENSETR_RNG2EN              B(6)
#define RCC_MC_AHB3ENSETR_CRC2EN              B(7)
#define RCC_MC_AHB3ENSETR_HSEMEN              B(11)
#define RCC_MC_AHB3ENSETR_IPCCEN              B(12)

/*******************  Bit definition for RCC_MC_AHB3ENCLRR register  ************/
/*!< This register is used to clear the peripheral clock enable bit of the corresponding
 * peripheral. It shall be used to deallocate a peripheral from MCU */
#define RCC_MC_AHB3ENCLRR_DCMIEN              B(0)
#if defined (STM32MP157Cxx) || defined (STM32MP157Fxx) || defined (STM32MP153Cxx) || defined (STM32MP153Fxx) || defined (STM32MP151Cxx) || defined (STM32MP151Fxx)
#define RCC_MC_AHB3ENCLRR_CRYP2EN             B(4)
#endif
#define RCC_MC_AHB3ENCLRR_HASH2EN             B(5)
#define RCC_MC_AHB3ENCLRR_RNG2EN              B(6)
#define RCC_MC_AHB3ENCLRR_CRC2EN              B(7)
#define RCC_MC_AHB3ENCLRR_HSEMEN              B(11)
#define RCC_MC_AHB3ENCLRR_IPCCEN              B(12)

/*******************  Bit definition for RCC_MC_AHB4ENSETR register  ***********/
/*!<  This register is used to set the peripheral clock enable bit of the corresponding
 * peripheral to 1.  It shall be used to allocate a peripheral to the MCU. */
#define RCC_MC_AHB4ENSETR_GPIOAEN             B(0)
#define RCC_MC_AHB4ENSETR_GPIOBEN             B(1)
#define RCC_MC_AHB4ENSETR_GPIOCEN             B(2)
#define RCC_MC_AHB4ENSETR_GPIODEN             B(3)
#define RCC_MC_AHB4ENSETR_GPIOEEN             B(4)
#define RCC_MC_AHB4ENSETR_GPIOFEN             B(5)
#define RCC_MC_AHB4ENSETR_GPIOGEN             B(6)
#define RCC_MC_AHB4ENSETR_GPIOHEN             B(7)
#define RCC_MC_AHB4ENSETR_GPIOIEN             B(8)
#define RCC_MC_AHB4ENSETR_GPIOJEN             B(9)
#define RCC_MC_AHB4ENSETR_GPIOKEN             B(10)

/*******************  Bit definition for RCC_MC_AHB4ENCLRR register  ************/
/*!< This register is used to clear the peripheral clock enable bit of the corresponding
 * peripheral. It shall be used to deallocate a peripheral from MCU */
#define RCC_MC_AHB4ENCLRR_GPIOAEN             B(0)
#define RCC_MC_AHB4ENCLRR_GPIOBEN             B(1)
#define RCC_MC_AHB4ENCLRR_GPIOCEN             B(2)
#define RCC_MC_AHB4ENCLRR_GPIODEN             B(3)
#define RCC_MC_AHB4ENCLRR_GPIOEEN             B(4)
#define RCC_MC_AHB4ENCLRR_GPIOFEN             B(5)
#define RCC_MC_AHB4ENCLRR_GPIOGEN             B(6)
#define RCC_MC_AHB4ENCLRR_GPIOHEN             B(7)
#define RCC_MC_AHB4ENCLRR_GPIOIEN             B(8)
#define RCC_MC_AHB4ENCLRR_GPIOJEN             B(9)
#define RCC_MC_AHB4ENCLRR_GPIOKEN             B(10)

/*******************  Bit definition for RCC_MC_AXIMENSETR register  ***********/
/*!<  This register is used to set the peripheral clock enable bit of the corresponding
 * peripheral to 1.  It shall be used to allocate a peripheral to the MCU. */
#define RCC_MC_AXIMENSETR_SYSRAMEN            B(0)

/*******************  Bit definition for RCC_MC_AXIMENCLRR register  ************/
/*!< This register is used to clear the peripheral clock enable bit of the corresponding
 * peripheral. It shall be used to deallocate a peripheral from MCU */
#define RCC_MC_AXIMENCLRR_SYSRAMEN            B(0)

/*******************  Bit definition for RCC_MC_MLAHBENSETR register  ***********/
/*!<  This register is used to set the peripheral clock enable bit of the corresponding
 * peripheral to 1.  It shall be used to allocate a peripheral to the MCU. */
#define RCC_MC_MLAHBENSETR_RETRAMEN           B(4)

/*******************  Bit definition for RCC_MC_MLAHBENCLRR register  ************/
/*!< This register is used to clear the peripheral clock enable bit of the corresponding
 * peripheral. It shall be used to deallocate a peripheral from MCU */
#define RCC_MC_MLAHBENCLRR_RETRAMEN           B(4)


/*******************  Bit definition for RCC_MC_APB1LPENSETR register  ***********/
/*!<  This register is used by the MCU in order to set the PERxLPEN bit of the corresponding
 * peripheral to '1'. Writing '0' has no effect, writing '1' enables the peripheral clocks in
 * CSLEEP, reading '1' means that the peripheral clocks are enabled in CSLEEP */
#define RCC_MC_APB1LPENSETR_TIM2LPEN              B(0)
#define RCC_MC_APB1LPENSETR_TIM3LPEN              B(1)
#define RCC_MC_APB1LPENSETR_TIM4LPEN              B(2)
#define RCC_MC_APB1LPENSETR_TIM5LPEN              B(3)
#define RCC_MC_APB1LPENSETR_TIM6LPEN              B(4)
#define RCC_MC_APB1LPENSETR_TIM7LPEN              B(5)
#define RCC_MC_APB1LPENSETR_TIM12LPEN             B(6)
#define RCC_MC_APB1LPENSETR_TIM13LPEN             B(7)
#define RCC_MC_APB1LPENSETR_TIM14LPEN             B(8)
#define RCC_MC_APB1LPENSETR_LPTIM1LPEN            B(9)
#define RCC_MC_APB1LPENSETR_SPI2LPEN              B(11)
#define RCC_MC_APB1LPENSETR_SPI3LPEN              B(12)
#define RCC_MC_APB1LPENSETR_USART2LPEN            B(14)
#define RCC_MC_APB1LPENSETR_USART3LPEN            B(15)
#define RCC_MC_APB1LPENSETR_UART4LPEN             B(16)
#define RCC_MC_APB1LPENSETR_UART5LPEN             B(17)
#define RCC_MC_APB1LPENSETR_UART7LPEN             B(18)
#define RCC_MC_APB1LPENSETR_UART8LPEN             B(19)
#define RCC_MC_APB1LPENSETR_I2C1LPEN              B(21)
#define RCC_MC_APB1LPENSETR_I2C2LPEN              B(22)
#define RCC_MC_APB1LPENSETR_I2C3LPEN              B(23)
#define RCC_MC_APB1LPENSETR_I2C5LPEN              B(24)
#define RCC_MC_APB1LPENSETR_SPDIFLPEN             B(26)
#define RCC_MC_APB1LPENSETR_CECLPEN               B(27)
#define RCC_MC_APB1LPENSETR_WWDG1LPEN             B(28)
#define RCC_MC_APB1LPENSETR_DAC12LPEN             B(29)
#define RCC_MC_APB1LPENSETR_MDIOSLPEN             B(31)

