STMicroelectronics/X-CUBE-NFC4/Drivers/CMSIS/Device/ST/STM32MP1xx/Include/stm32mp1xxxxx.h
/*******************  Bit definition for RCC_MC_APB1LPENCLRR register  ************/
/*!< This register is used by the MCU in order to clear the PERxLPEN bits of the corresponding
 * peripheral. Writing '0' has no effect, reading will return the effective values of the
 * corresponding bits. Writing a '1' sets the corresponding bit to '0' */
#define RCC_MC_APB1LPENCLRR_TIM2LPEN              B(0)
#define RCC_MC_APB1LPENCLRR_TIM3LPEN              B(1)
#define RCC_MC_APB1LPENCLRR_TIM4LPEN              B(2)
#define RCC_MC_APB1LPENCLRR_TIM5LPEN              B(3)
#define RCC_MC_APB1LPENCLRR_TIM6LPEN              B(4)
#define RCC_MC_APB1LPENCLRR_TIM7LPEN              B(5)
#define RCC_MC_APB1LPENCLRR_TIM12LPEN             B(6)
#define RCC_MC_APB1LPENCLRR_TIM13LPEN             B(7)
#define RCC_MC_APB1LPENCLRR_TIM14LPEN             B(8)
#define RCC_MC_APB1LPENCLRR_LPTIM1LPEN            B(9)
#define RCC_MC_APB1LPENCLRR_SPI2LPEN              B(11)
#define RCC_MC_APB1LPENCLRR_SPI3LPEN              B(12)
#define RCC_MC_APB1LPENCLRR_USART2LPEN            B(14)
#define RCC_MC_APB1LPENCLRR_USART3LPEN            B(15)
#define RCC_MC_APB1LPENCLRR_UART4LPEN             B(16)
#define RCC_MC_APB1LPENCLRR_UART5LPEN             B(17)
#define RCC_MC_APB1LPENCLRR_UART7LPEN             B(18)
#define RCC_MC_APB1LPENCLRR_UART8LPEN             B(19)
#define RCC_MC_APB1LPENCLRR_I2C1LPEN              B(21)
#define RCC_MC_APB1LPENCLRR_I2C2LPEN              B(22)
#define RCC_MC_APB1LPENCLRR_I2C3LPEN              B(23)
#define RCC_MC_APB1LPENCLRR_I2C5LPEN              B(24)
#define RCC_MC_APB1LPENCLRR_SPDIFLPEN             B(26)
#define RCC_MC_APB1LPENCLRR_CECLPEN               B(27)
#define RCC_MC_APB1LPENCLRR_WWDG1LPEN             B(28)
#define RCC_MC_APB1LPENCLRR_DAC12LPEN             B(29)
#define RCC_MC_APB1LPENCLRR_MDIOSLPEN             B(31)

/*******************  Bit definition for RCC_MC_APB2LPENSETR register  ***********/
/*!<  This register is used by the MCU in order to set the PERxLPEN bit of the corresponding
 * peripheral to '1'. Writing '0' has no effect, writing '1' enables the peripheral clocks in
 * CSLEEP, reading '1' means that the peripheral clocks are enabled in CSLEEP */
#define RCC_MC_APB2LPENSETR_TIM1LPEN              B(0)
#define RCC_MC_APB2LPENSETR_TIM8LPEN              B(1)
#define RCC_MC_APB2LPENSETR_TIM15LPEN             B(2)
#define RCC_MC_APB2LPENSETR_TIM16LPEN             B(3)
#define RCC_MC_APB2LPENSETR_TIM17LPEN             B(4)
#define RCC_MC_APB2LPENSETR_SPI1LPEN              B(8)
#define RCC_MC_APB2LPENSETR_SPI4LPEN              B(9)
#define RCC_MC_APB2LPENSETR_SPI5LPEN              B(10)
#define RCC_MC_APB2LPENSETR_USART6LPEN            B(13)
#define RCC_MC_APB2LPENSETR_SAI1LPEN              B(16)
#define RCC_MC_APB2LPENSETR_SAI2LPEN              B(17)
#define RCC_MC_APB2LPENSETR_SAI3LPEN              B(18)
#define RCC_MC_APB2LPENSETR_DFSDMLPEN             B(20)
#define RCC_MC_APB2LPENSETR_ADFSDMLPEN            B(21)
#if defined (STM32MP157Cxx) || defined (STM32MP157Fxx) || defined (STM32MP157Axx) || defined (STM32MP157Dxx) || defined (STM32MP153Cxx) || defined (STM32MP153Fxx) || defined (STM32MP153Axx) || defined (STM32MP153Dxx)
#define RCC_MC_APB2LPENSETR_FDCANLPEN             B(24)
#endif

/*******************  Bit definition for RCC_MC_APB2LPENCLRR register  ************/
/*!< This register is used by the MCU in order to clear the PERxLPEN bits of the corresponding
 * peripheral. Writing '0' has no effect, reading will return the effective values of the
 * corresponding bits. Writing a '1' sets the corresponding bit to '0' */
#define RCC_MC_APB2LPENCLRR_TIM1LPEN              B(0)
#define RCC_MC_APB2LPENCLRR_TIM8LPEN              B(1)
#define RCC_MC_APB2LPENCLRR_TIM15LPEN             B(2)
#define RCC_MC_APB2LPENCLRR_TIM16LPEN             B(3)
#define RCC_MC_APB2LPENCLRR_TIM17LPEN             B(4)
#define RCC_MC_APB2LPENCLRR_SPI1LPEN              B(8)
#define RCC_MC_APB2LPENCLRR_SPI4LPEN              B(9)
#define RCC_MC_APB2LPENCLRR_SPI5LPEN              B(10)
#define RCC_MC_APB2LPENCLRR_USART6LPEN            B(13)
#define RCC_MC_APB2LPENCLRR_SAI1LPEN              B(16)
#define RCC_MC_APB2LPENCLRR_SAI2LPEN              B(17)
#define RCC_MC_APB2LPENCLRR_SAI3LPEN              B(18)
#define RCC_MC_APB2LPENCLRR_DFSDMLPEN             B(20)
#define RCC_MC_APB2LPENCLRR_ADFSDMLPEN            B(21)
#if defined (STM32MP157Cxx) || defined (STM32MP157Fxx) || defined (STM32MP157Axx) || defined (STM32MP157Dxx) || defined (STM32MP153Cxx) || defined (STM32MP153Fxx) || defined (STM32MP153Axx) || defined (STM32MP153Dxx)
#define RCC_MC_APB2LPENCLRR_FDCANLPEN             B(24)
#endif

/*******************  Bit definition for RCC_MC_APB3LPENSETR register  ***********/
/*!<  This register is used by the MCU in order to set the PERxLPEN bit of the corresponding
 * peripheral to '1'. Writing '0' has no effect, writing '1' enables the peripheral clocks in
 * CSLEEP, reading '1' means that the peripheral clocks are enabled in CSLEEP */
#define RCC_MC_APB3LPENSETR_LPTIM2LPEN            B(0)
#define RCC_MC_APB3LPENSETR_LPTIM3LPEN            B(1)
#define RCC_MC_APB3LPENSETR_LPTIM4LPEN            B(2)
#define RCC_MC_APB3LPENSETR_LPTIM5LPEN            B(3)
#define RCC_MC_APB3LPENSETR_SAI4LPEN              B(8)
#define RCC_MC_APB3LPENSETR_SYSCFGLPEN            B(11)
#define RCC_MC_APB3LPENSETR_VREFLPEN              B(13)
#define RCC_MC_APB3LPENSETR_DTSLPEN               B(16)
#define RCC_MC_APB3LPENSETR_PMBCTRLLPEN           B(17)

/*******************  Bit definition for RCC_MC_APB3LPENCLRR register  ************/
/*!<  This register is used by the MCU in order to set the PERxLPEN bit of the corresponding
 * peripheral to '1'. Writing '0' has no effect, writing '1' enables the peripheral clocks in
 * CSLEEP, reading '1' means that the peripheral clocks are enabled in CSLEEP */
#define RCC_MC_APB3LPENCLRR_LPTIM2LPEN            B(0)
#define RCC_MC_APB3LPENCLRR_LPTIM3LPEN            B(1)
#define RCC_MC_APB3LPENCLRR_LPTIM4LPEN            B(2)
#define RCC_MC_APB3LPENCLRR_LPTIM5LPEN            B(3)
#define RCC_MC_APB3LPENCLRR_SAI4LPEN              B(8)
#define RCC_MC_APB3LPENCLRR_SYSCFGLPEN            B(11)
#define RCC_MC_APB3LPENCLRR_VREFLPEN              B(13)
#define RCC_MC_APB3LPENCLRR_DTSLPEN               B(16)
#define RCC_MC_APB3LPENCLRR_PMBCTRLLPEN           B(17)

/*******************  Bit definition for RCC_MC_APB4LPENSETR register  ***********/
/*!<  This register is used by the MCU in order to set the PERxLPEN bit of the corresponding
 * peripheral to '1'. Writing '0' has no effect, writing '1' enables the peripheral clocks in
 * CSLEEP, reading '1' means that the peripheral clocks are enabled in CSLEEP */
#define RCC_MC_APB4LPENSETR_LTDCLPEN              B(0)
#if defined (STM32MP157Cxx) || defined (STM32MP157Fxx) || defined (STM32MP157Axx) || defined (STM32MP157Dxx)
#define RCC_MC_APB4LPENSETR_DSILPEN               B(4)
#endif
#define RCC_MC_APB4LPENSETR_USBPHYLPEN            B(16)
#define RCC_MC_APB4LPENSETR_STGENROLPEN           B(20)
#define RCC_MC_APB4LPENSETR_STGENROSTPEN          B(21)

/*******************  Bit definition for RCC_MP_APB4LPENSETR register  ***********/
/*!<  This register is used by the MPU in order to set the PERxLPEN bit of the corresponding
 * peripheral to '1'. Writing '0' has no effect, writing '1' enables the peripheral clocks in
 * CSLEEP, reading '1' means that the peripheral clocks are enabled in CSLEEP */
#define RCC_MP_APB4LPENSETR_LTDCLPEN              B(0)
#if defined (STM32MP157Cxx) || defined (STM32MP157Fxx) || defined (STM32MP157Axx) || defined (STM32MP157Dxx)
#define RCC_MP_APB4LPENSETR_DSILPEN               B(4)
#endif
#define RCC_MP_APB4LPENSETR_IWDG2APBLPEN          B(15)
#define RCC_MP_APB4LPENSETR_USBPHYLPEN            B(16)
#define RCC_MP_APB4LPENSETR_STGENROLPEN           B(20)
#define RCC_MP_APB4LPENSETR_STGENROSTPEN          B(21)

/*******************  Bit definition for RCC_MC_APB4LPENCLRR register  ************/
/*!< This register is used by the MCU in order to clear the PERxLPEN bits of the corresponding
 * peripheral. Writing '0' has no effect, reading will return the effective values of the
 * corresponding bits. Writing a '1' sets the corresponding bit to '0' */
#define RCC_MC_APB4LPENCLRR_LTDCLPEN              B(0)
#if defined (STM32MP157Cxx) || defined (STM32MP157Fxx) || defined (STM32MP157Axx) || defined (STM32MP157Dxx)
#define RCC_MC_APB4LPENCLRR_DSILPEN               B(4)
#endif
#define RCC_MC_APB4LPENCLRR_USBPHYLPEN            B(16)
#define RCC_MC_APB4LPENCLRR_STGENROLPEN           B(20)
#define RCC_MC_APB4LPENCLRR_STGENROSTPEN          B(21)

/*******************  Bit definition for RCC_MP_APB4LPENCLRR register  ************/
/*!< This register is used by the MCU in order to clear the PERxLPEN bits of the corresponding
 * peripheral. Writing '0' has no effect, reading will return the effective values of the
 * corresponding bits. Writing a '1' sets the corresponding bit to '0' */
#define RCC_MP_APB4LPENCLRR_LTDCLPEN              B(0)
#if defined (STM32MP157Cxx) || defined (STM32MP157Fxx) || defined (STM32MP157Axx) || defined (STM32MP157Dxx)
#define RCC_MP_APB4LPENCLRR_DSILPEN               B(4)
#endif
#define RCC_MP_APB4LPENCLRR_IWDG2APBLPEN          B(15)
#define RCC_MP_APB4LPENCLRR_USBPHYLPEN            B(16)
#define RCC_MP_APB4LPENCLRR_STGENROLPEN           B(20)
#define RCC_MP_APB4LPENCLRR_STGENROSTPEN          B(21)

