STMicroelectronics/X-CUBE-NFC4/Drivers/CMSIS/Device/ST/STM32MP1xx/Include/stm32mp1xxxxx.h
/*******************  Bit definition for RCC_MC_APB5LPENSETR register  ***********/
/*!<  This register is used by the MCU in order to set the PERxLPEN bit of the corresponding
 * peripheral to '1'. Writing '0' has no effect, writing '1' enables the peripheral clocks in
 * CSLEEP, reading '1' means that the peripheral clocks are enabled in CSLEEP */
#define RCC_MC_APB5LPENSETR_SPI6LPEN              B(0)
#define RCC_MC_APB5LPENSETR_I2C4LPEN              B(2)
#define RCC_MC_APB5LPENSETR_I2C6LPEN              B(3)
#define RCC_MC_APB5LPENSETR_USART1LPEN            B(4)
#define RCC_MC_APB5LPENSETR_RTCAPBLPEN            B(8)
#define RCC_MC_APB5LPENSETR_TZC1LPEN              B(11)
#define RCC_MC_APB5LPENSETR_TZC2LPEN              B(12)
#define RCC_MC_APB5LPENSETR_TZPCLPEN              B(13)
#define RCC_MC_APB5LPENSETR_BSECLPEN              B(16)
#define RCC_MC_APB5LPENSETR_STGENLPEN             B(20)
#define RCC_MC_APB5LPENSETR_STGENSTPEN            B(21)


/*******************  Bit definition for RCC_MC_APB5LPENCLRR register  ************/
/*!< This register is used by the MCU in order to clear the PERxLPEN bits of the corresponding
 * peripheral. Writing '0' has no effect, reading will return the effective values of the
 * corresponding bits. Writing a '1' sets the corresponding bit to '0' */
#define RCC_MC_APB5LPENCLRR_SPI6LPEN              B(0)
#define RCC_MC_APB5LPENCLRR_I2C4LPEN              B(2)
#define RCC_MC_APB5LPENCLRR_I2C6LPEN              B(3)
#define RCC_MC_APB5LPENCLRR_USART1LPEN            B(4)
#define RCC_MC_APB5LPENCLRR_RTCAPBLPEN            B(8)
#define RCC_MC_APB5LPENCLRR_TZC1LPEN              B(11)
#define RCC_MC_APB5LPENCLRR_TZC2LPEN              B(12)
#define RCC_MC_APB5LPENCLRR_TZPCLPEN              B(13)
#define RCC_MC_APB5LPENCLRR_BSECLPEN              B(16)
#define RCC_MC_APB5LPENCLRR_STGENLPEN             B(20)
#define RCC_MC_APB5LPENCLRR_STGENSTPEN            B(21)

/*******************  Bit definition for RCC_MC_AHB5LPENSETR register  ***********/
/*!<  This register is used by the MCU in order to set the PERxLPEN bit of the corresponding
 * peripheral to '1'. Writing '0' has no effect, writing '1' enables the peripheral clocks in
 * CSLEEP, reading '1' means that the peripheral clocks are enabled in CSLEEP */
#define RCC_MC_AHB5LPENSETR_GPIOZLPEN             B(0)
#if defined (STM32MP157Cxx) || defined (STM32MP157Fxx) || defined (STM32MP153Cxx) || defined (STM32MP153Fxx) || defined (STM32MP151Cxx) || defined (STM32MP151Fxx)
#define RCC_MC_AHB5LPENSETR_CRYP1LPEN             B(4)
#endif
#define RCC_MC_AHB5LPENSETR_HASH1LPEN             B(5)
#define RCC_MC_AHB5LPENSETR_RNG1LPEN              B(6)
#define RCC_MC_AHB5LPENSETR_BKPSRAMLPEN           B(8)

/*******************  Bit definition for RCC_MC_AHB5LPENCLRR register  ************/
/*!< This register is used by the MCU in order to clear the PERxLPEN bits of the corresponding
 * peripheral. Writing '0' has no effect, reading will return the effective values of the
 * corresponding bits. Writing a '1' sets the corresponding bit to '0' */
#define RCC_MC_AHB5LPENCLRR_GPIOZLPEN             B(0)
#if defined (STM32MP157Cxx) || defined (STM32MP157Fxx) || defined (STM32MP153Cxx) || defined (STM32MP153Fxx) || defined (STM32MP151Cxx) || defined (STM32MP151Fxx)
#define RCC_MC_AHB5LPENCLRR_CRYP1LPEN             B(4)
#endif
#define RCC_MC_AHB5LPENCLRR_HASH1LPEN             B(5)
#define RCC_MC_AHB5LPENCLRR_RNG1LPEN              B(6)
#define RCC_MC_AHB5LPENCLRR_BKPSRAMLPEN           B(8)

/*******************  Bit definition for RCC_MC_AHB6LPENSETR register  ***********/
/*!<  This register is used by the MCU in order to set the PERxLPEN bit of the corresponding
 * peripheral to '1'. Writing '0' has no effect, writing '1' enables the peripheral clocks in
 * CSLEEP, reading '1' means that the peripheral clocks are enabled in CSLEEP */
#define RCC_MC_AHB6LPENSETR_MDMALPEN              B(0)
#if defined (STM32MP157Cxx) || defined (STM32MP157Fxx) || defined (STM32MP157Axx) || defined (STM32MP157Dxx)
#define RCC_MC_AHB6LPENSETR_GPULPEN               B(5)
#endif
#define RCC_MC_AHB6LPENSETR_ETHCKLPEN             B(7)
#define RCC_MC_AHB6LPENSETR_ETHTXLPEN             B(8)
#define RCC_MC_AHB6LPENSETR_ETHRXLPEN             B(9)
#define RCC_MC_AHB6LPENSETR_ETHMACLPEN            B(10)
#define RCC_MC_AHB6LPENSETR_ETHSTPEN              B(11)
#define RCC_MC_AHB6LPENSETR_FMCLPEN               B(12)
#define RCC_MC_AHB6LPENSETR_QSPILPEN              B(14)
#define RCC_MC_AHB6LPENSETR_SDMMC1LPEN            B(16)
#define RCC_MC_AHB6LPENSETR_SDMMC2LPEN            B(17)
#define RCC_MC_AHB6LPENSETR_CRC1LPEN              B(20)
#define RCC_MC_AHB6LPENSETR_USBHLPEN              B(24)

/*******************  Bit definition for RCC_MC_AHB6LPENCLRR register  ************/
/*!< This register is used by the MCU in order to clear the PERxLPEN bits of the corresponding
 * peripheral. Writing '0' has no effect, reading will return the effective values of the
 * corresponding bits. Writing a '1' sets the corresponding bit to '0' */
#define RCC_MC_AHB6LPENCLRR_MDMALPEN              B(0)
#if defined (STM32MP157Cxx) || defined (STM32MP157Fxx) || defined (STM32MP157Axx) || defined (STM32MP157Dxx)
#define RCC_MC_AHB6LPENCLRR_GPULPEN               B(5)
#endif
#define RCC_MC_AHB6LPENCLRR_ETHCKLPEN             B(7)
#define RCC_MC_AHB6LPENCLRR_ETHTXLPEN             B(8)
#define RCC_MC_AHB6LPENCLRR_ETHRXLPEN             B(9)
#define RCC_MC_AHB6LPENCLRR_ETHMACLPEN            B(10)
#define RCC_MC_AHB6LPENCLRR_ETHSTPEN              B(11)
#define RCC_MC_AHB6LPENCLRR_FMCLPEN               B(12)
#define RCC_MC_AHB6LPENCLRR_QSPILPEN              B(14)
#define RCC_MC_AHB6LPENCLRR_SDMMC1LPEN            B(16)
#define RCC_MC_AHB6LPENCLRR_SDMMC2LPEN            B(17)
#define RCC_MC_AHB6LPENCLRR_CRC1LPEN              B(20)
#define RCC_MC_AHB6LPENCLRR_USBHLPEN              B(24)

/*******************  Bit definition for RCC_MP_TZAHB6LPENSETR register  ***********/
/*!<  This register is used by the MCU in order to set the PERxLPEN bit of the corresponding
 * peripheral to '1'. Writing '0' has no effect, writing '1' enables the peripheral clocks in
 * CSLEEP, reading '1' means that the peripheral clocks are enabled in CSLEEP */
#define RCC_MP_TZAHB6LPENSETR_MDMALPEN            B(0)

/*******************  Bit definition for RCC_MP_TZAHB6LPENCLRR register  ************/
/*!< This register is used by the MCU in order to clear the PERxLPEN bits of the corresponding
 * peripheral. Writing '0' has no effect, reading will return the effective values of the
 * corresponding bits. Writing a '1' sets the corresponding bit to '0' */
#define RCC_MC_TZAHB6LPENCLRR_MDMALPEN            B(0)

/*******************  Bit definition for RCC_MC_AHB2LPENSETR register  ***********/
/*!<  This register is used by the MCU in order to set the PERxLPEN bit of the corresponding
 * peripheral to '1'. Writing '0' has no effect, writing '1' enables the peripheral clocks in
 * CSLEEP, reading '1' means that the peripheral clocks are enabled in CSLEEP */
#define RCC_MC_AHB2LPENSETR_DMA1LPEN              B(0)
#define RCC_MC_AHB2LPENSETR_DMA2LPEN              B(1)
#define RCC_MC_AHB2LPENSETR_DMAMUXLPEN            B(2)
#define RCC_MC_AHB2LPENSETR_ADC12LPEN             B(5)
#define RCC_MC_AHB2LPENSETR_USBOLPEN              B(8)
#define RCC_MC_AHB2LPENSETR_SDMMC3LPEN            B(16)

/*******************  Bit definition for RCC_MC_AHB2LPENCLRR register  ************/
/*!< This register is used by the MCU in order to clear the PERxLPEN bits of the corresponding
 * peripheral. Writing '0' has no effect, reading will return the effective values of the
 * corresponding bits. Writing a '1' sets the corresponding bit to '0' */
#define RCC_MC_AHB2LPENCLRR_DMA1LPEN              B(0)
#define RCC_MC_AHB2LPENCLRR_DMA2LPEN              B(1)
#define RCC_MC_AHB2LPENCLRR_DMAMUXLPEN            B(2)
#define RCC_MC_AHB2LPENCLRR_ADC12LPEN             B(5)
#define RCC_MC_AHB2LPENCLRR_USBOLPEN              B(8)
#define RCC_MC_AHB2LPENCLRR_SDMMC3LPEN            B(16)

/*******************  Bit definition for RCC_MC_AHB3LPENSETR register  ***********/
/*!<  This register is used by the MCU in order to set the PERxLPEN bit of the corresponding
 * peripheral to '1'. Writing '0' has no effect, writing '1' enables the peripheral clocks in
 * CSLEEP, reading '1' means that the peripheral clocks are enabled in CSLEEP */
#define RCC_MC_AHB3LPENSETR_DCMILPEN              B(0)
#if defined (STM32MP157Cxx) || defined (STM32MP157Fxx) || defined (STM32MP153Cxx) || defined (STM32MP153Fxx) || defined (STM32MP151Cxx) || defined (STM32MP151Fxx)
#define RCC_MC_AHB3LPENSETR_CRYP2LPEN             B(4)
#endif
#define RCC_MC_AHB3LPENSETR_HASH2LPEN             B(5)
#define RCC_MC_AHB3LPENSETR_RNG2LPEN              B(6)
#define RCC_MC_AHB3LPENSETR_CRC2LPEN              B(7)
#define RCC_MC_AHB3LPENSETR_HSEMLPEN              B(11)
#define RCC_MC_AHB3LPENSETR_IPCCLPEN              B(12)

