STMicroelectronics/X-CUBE-NFC4/Drivers/CMSIS/Device/ST/STM32MP1xx/Include/stm32mp1xxxxx.h
/*******************  Bit definition for RCC_MC_AHB3LPENCLRR register  ************/
/*!< This register is used by the MCU in order to clear the PERxLPEN bits of the corresponding
 * peripheral. Writing '0' has no effect, reading will return the effective values of the
 * corresponding bits. Writing a '1' sets the corresponding bit to '0' */
#define RCC_MC_AHB3LPENCLRR_DCMILPEN              B(0)
#if defined (STM32MP157Cxx) || defined (STM32MP157Fxx) || defined (STM32MP153Cxx) || defined (STM32MP153Fxx) || defined (STM32MP151Cxx) || defined (STM32MP151Fxx)
#define RCC_MC_AHB3LPENCLRR_CRYP2LPEN             B(4)
#endif
#define RCC_MC_AHB3LPENCLRR_HASH2LPEN             B(5)
#define RCC_MC_AHB3LPENCLRR_RNG2LPEN              B(6)
#define RCC_MC_AHB3LPENCLRR_CRC2LPEN              B(7)
#define RCC_MC_AHB3LPENCLRR_HSEMLPEN              B(11)
#define RCC_MC_AHB3LPENCLRR_IPCCLPEN              B(12)

/*******************  Bit definition for RCC_MC_AHB4LPENSETR register  ***********/
/*!<  This register is used by the MCU in order to set the PERxLPEN bit of the corresponding
 * peripheral to '1'. Writing '0' has no effect, writing '1' enables the peripheral clocks in
 * CSLEEP, reading '1' means that the peripheral clocks are enabled in CSLEEP */
#define RCC_MC_AHB4LPENSETR_GPIOALPEN             B(0)
#define RCC_MC_AHB4LPENSETR_GPIOBLPEN             B(1)
#define RCC_MC_AHB4LPENSETR_GPIOCLPEN             B(2)
#define RCC_MC_AHB4LPENSETR_GPIODLPEN             B(3)
#define RCC_MC_AHB4LPENSETR_GPIOELPEN             B(4)
#define RCC_MC_AHB4LPENSETR_GPIOFLPEN             B(5)
#define RCC_MC_AHB4LPENSETR_GPIOGLPEN             B(6)
#define RCC_MC_AHB4LPENSETR_GPIOHLPEN             B(7)
#define RCC_MC_AHB4LPENSETR_GPIOILPEN             B(8)
#define RCC_MC_AHB4LPENSETR_GPIOJLPEN             B(9)
#define RCC_MC_AHB4LPENSETR_GPIOKLPEN             B(10)

/*******************  Bit definition for RCC_MC_AHB4LPENCLRR register  ************/
/*!< This register is used by the MCU in order to clear the PERxLPEN bits of the corresponding
 * peripheral. Writing '0' has no effect, reading will return the effective values of the
 * corresponding bits. Writing a '1' sets the corresponding bit to '0' */
#define RCC_MC_AHB4LPENCLRR_GPIOALPEN             B(0)
#define RCC_MC_AHB4LPENCLRR_GPIOBLPEN             B(1)
#define RCC_MC_AHB4LPENCLRR_GPIOCLPEN             B(2)
#define RCC_MC_AHB4LPENCLRR_GPIODLPEN             B(3)
#define RCC_MC_AHB4LPENCLRR_GPIOELPEN             B(4)
#define RCC_MC_AHB4LPENCLRR_GPIOFLPEN             B(5)
#define RCC_MC_AHB4LPENCLRR_GPIOGLPEN             B(6)
#define RCC_MC_AHB4LPENCLRR_GPIOHLPEN             B(7)
#define RCC_MC_AHB4LPENCLRR_GPIOILPEN             B(8)
#define RCC_MC_AHB4LPENCLRR_GPIOJLPEN             B(9)
#define RCC_MC_AHB4LPENCLRR_GPIOKLPEN             B(10)

/*******************  Bit definition for RCC_MC_AXIMLPENSETR register  ***********/
/*!<  This register is used by the MCU in order to set the PERxLPEN bit of the corresponding
 * peripheral to '1'. Writing '0' has no effect, writing '1' enables the peripheral clocks in
 * CSLEEP, reading '1' means that the peripheral clocks are enabled in CSLEEP */
#define RCC_MC_AXIMLPENSETR_SYSRAMLPEN            B(0)

/*******************  Bit definition for RCC_MC_AXIMLPENCLRR register  ************/
/*!< This register is used by the MCU in order to clear the PERxLPEN bits of the corresponding
 * peripheral. Writing '0' has no effect, reading will return the effective values of the
 * corresponding bits. Writing a '1' sets the corresponding bit to '0' */
#define RCC_MC_AXIMLPENCLRR_SYSRAMLPEN            B(0)

/*******************  Bit definition for RCC_MC_MLAHBLPENSETR register  ***********/
/*!<  This register is used by the MCU in order to set the PERxLPEN bit of the corresponding
 * peripheral to '1'. Writing '0' has no effect, writing '1' enables the peripheral clocks in
 * CSLEEP, reading '1' means that the peripheral clocks are enabled in CSLEEP */
#define RCC_MC_MLAHBLPENSETR_SRAM1LPEN            B(0)
#define RCC_MC_MLAHBLPENSETR_SRAM2LPEN            B(1)
#define RCC_MC_MLAHBLPENSETR_SRAM3LPEN            B(2)
#define RCC_MC_MLAHBLPENSETR_RETRAMLPEN           B(4)

/*******************  Bit definition for RCC_MC_MLAHBLPENCLRR register  ************/
/*!< This register is used by the MCU in order to clear the PERxLPEN bits of the corresponding
 * peripheral. Writing '0' has no effect, reading will return the effective values of the
 * corresponding bits. Writing a '1' sets the corresponding bit to '0' */
#define RCC_MC_MLAHBLPENCLRR_SRAM1LPEN            B(0)
#define RCC_MC_MLAHBLPENCLRR_SRAM2LPEN            B(1)
#define RCC_MC_MLAHBLPENCLRR_SRAM3LPEN            B(2)
#define RCC_MC_MLAHBLPENCLRR_RETRAMLPEN           B(4)


/*******************  Bit definition for RCC_BR_RSTSCLRR register  ************/
/*!< This register is used by the BOOTROM to check the reset source.
 * Writing "0" has no effect, reading will return the effective values of the corresponding
 * bits. Writing a '1' clears the corresponding bit to '0'
 *
 * @note In order to identify the reset source, the MPU application must use
 *       RCC MPU Reset Status Clear Register (RCC_MP_RSTSCLRR), and the MCU application
 *       must use the RCC MCU Reset Status Clear Register (RCC_MC_RSTSCLRR).
 * @note This register except MPUP[1:0]RSTF flags is located into VDD domain,
 *       and is reset by por_rst reset.
 * @note If TZEN = '1', this register can only be modified in secure mode.
 */
#define RCC_BR_RSTSCLRR_PORRSTF_Pos           (0U)
#define RCC_BR_RSTSCLRR_PORRSTF_Msk           (0x1U << RCC_BR_RSTSCLRR_PORRSTF_Pos)   /*!< 0x00000001 */
#define RCC_BR_RSTSCLRR_PORRSTF               RCC_BR_RSTSCLRR_PORRSTF_Msk             /*POR/PDR reset flag*/

#define RCC_BR_RSTSCLRR_BORRSTF_Pos           (1U)
#define RCC_BR_RSTSCLRR_BORRSTF_Msk           (0x1U << RCC_BR_RSTSCLRR_BORRSTF_Pos)   /*!< 0x00000002 */
#define RCC_BR_RSTSCLRR_BORRSTF               RCC_BR_RSTSCLRR_BORRSTF_Msk             /*BOR reset flag*/

