STMicroelectronics/X-CUBE-NFC4/Drivers/CMSIS/Device/ST/STM32MP1xx/Include/stm32mp1xxxxx.h
#define RCC_MP_RSTSCLRR_HCSSRSTF_Pos          (3U)
#define RCC_MP_RSTSCLRR_HCSSRSTF_Msk          (0x1U << RCC_MP_RSTSCLRR_HCSSRSTF_Pos)  /*!< 0x00000008 */
#define RCC_MP_RSTSCLRR_HCSSRSTF              RCC_MP_RSTSCLRR_HCSSRSTF_Msk            /*HSE CSS reset flag*/

#define RCC_MP_RSTSCLRR_VCORERSTF_Pos         (4U)
#define RCC_MP_RSTSCLRR_VCORERSTF_Msk         (0x1U << RCC_MP_RSTSCLRR_VCORERSTF_Pos) /*!< 0x00000010 */
#define RCC_MP_RSTSCLRR_VCORERSTF             RCC_MP_RSTSCLRR_VCORERSTF_Msk           /*VDDCORE reset flag*/

#define RCC_MP_RSTSCLRR_MPSYSRSTF_Pos         (6U)
#define RCC_MP_RSTSCLRR_MPSYSRSTF_Msk         (0x1U << RCC_MP_RSTSCLRR_MPSYSRSTF_Pos) /*!< 0x00000040 */
#define RCC_MP_RSTSCLRR_MPSYSRSTF             RCC_MP_RSTSCLRR_MPSYSRSTF_Msk           /*MPU System reset flag*/

#define RCC_MP_RSTSCLRR_MCSYSRSTF_Pos         (7U)
#define RCC_MP_RSTSCLRR_MCSYSRSTF_Msk         (0x1U << RCC_MP_RSTSCLRR_MCSYSRSTF_Pos) /*!< 0x00000080 */
#define RCC_MP_RSTSCLRR_MCSYSRSTF             RCC_MP_RSTSCLRR_MCSYSRSTF_Msk           /*MCU System reset flag*/

#define RCC_MP_RSTSCLRR_IWDG1RSTF_Pos         (8U)
#define RCC_MP_RSTSCLRR_IWDG1RSTF_Msk         (0x1U << RCC_MP_RSTSCLRR_IWDG1RSTF_Pos) /*!< 0x00000100 */
#define RCC_MP_RSTSCLRR_IWDG1RSTF             RCC_MP_RSTSCLRR_IWDG1RSTF_Msk           /*IWDG1 reset flag*/

#define RCC_MP_RSTSCLRR_IWDG2RSTF_Pos         (9U)
#define RCC_MP_RSTSCLRR_IWDG2RSTF_Msk         (0x1U << RCC_MP_RSTSCLRR_IWDG2RSTF_Pos) /*!< 0x00000200 */
#define RCC_MP_RSTSCLRR_IWDG2RSTF             RCC_MP_RSTSCLRR_IWDG2RSTF_Msk           /*IWDG2 reset flag*/

#define RCC_MP_RSTSCLRR_STDBYRSTF_Pos         (11U)
#define RCC_MP_RSTSCLRR_STDBYRSTF_Msk         (0x1U << RCC_MP_RSTSCLRR_STDBYRSTF_Pos) /*!< 0x00000800 */
#define RCC_MP_RSTSCLRR_STDBYRSTF             RCC_MP_RSTSCLRR_STDBYRSTF_Msk           /*System Standby reset flag*/

#define RCC_MP_RSTSCLRR_CSTDBYRSTF_Pos        (12U)
#define RCC_MP_RSTSCLRR_CSTDBYRSTF_Msk        (0x1U << RCC_MP_RSTSCLRR_CSTDBYRSTF_Pos) /*!< 0x00001000 */
#define RCC_MP_RSTSCLRR_CSTDBYRSTF            RCC_MP_RSTSCLRR_CSTDBYRSTF_Msk           /*MPU CStandby reset flag*/

#define RCC_MP_RSTSCLRR_MPUP0RSTF_Pos         (13U)
#define RCC_MP_RSTSCLRR_MPUP0RSTF_Msk         (0x1U << RCC_MP_RSTSCLRR_MPUP0RSTF_Pos) /*!< 0x00002000 */
#define RCC_MP_RSTSCLRR_MPUP0RSTF             RCC_MP_RSTSCLRR_MPUP0RSTF_Msk           /*MPU processor 0 reset flag*/

#define RCC_MP_RSTSCLRR_MPUP1RSTF_Pos         (14U)
#define RCC_MP_RSTSCLRR_MPUP1RSTF_Msk         (0x1U << RCC_MP_RSTSCLRR_MPUP1RSTF_Pos) /*!< 0x00004000 */
#define RCC_MP_RSTSCLRR_MPUP1RSTF             RCC_MP_RSTSCLRR_MPUP1RSTF_Msk           /*MPU processor 1 reset flag*/

#define RCC_MP_RSTSCLRR_SPARE_Pos             (15U)
#define RCC_MP_RSTSCLRR_SPARE_Msk             (0x1U << RCC_MP_RSTSCLRR_SPARE_Pos)     /*!< 0x00008000 */
#define RCC_MP_RSTSCLRR_SPARE                 RCC_MP_RSTSCLRR_SPARE_Msk               /*Spare bits*/

/*******************  Bit definition for RCC_MP_IWDGFZSETR register ************/
/*!< This register is used by the MPU in order to freeze the IWDGs clocks.
 * After a system reset or STANDBY reset (nreset), or a CSTANDBY reset (rst_cstby)
 * the MPU is allowed to write it once.
 * Writing "0" has no effect, reading will return the effective values of the corresponding
 * bits. Writing a "1" sets the corresponding bit to 1. If TZEN = 1, this register can only be
 * modified in secure mode.
 */
#define RCC_MP_IWDGFZSETR_FZ_IWDG1            B(0)
#define RCC_MP_IWDGFZSETR_FZ_IWDG2            B(1)


/*******************  Bit definition for RCC_MP_IWDGFZCLRR register ************/
/*!< This register is used by the MPU in order to unfreeze the IWDGs clocks.
 * Writing "0" has no effect, reading will return the effective values of the corresponding
 * bits. Writing a "1" clears the corresponding bit to 0. If TZEN = 1, this register can only
 * be modified in secure mode.
 */
#define RCC_MP_IWDGFZCLRR_FZ_IWDG1            B(0)
#define RCC_MP_IWDGFZCLRR_FZ_IWDG2            B(1)

/*******************  Bit definition for RCC_VERR register ************/
/*!< This register gives the IP version.  */
#define RCC_VERR_MINREV_Pos                   (0U)
#define RCC_VERR_MINREV_Msk                   (0xFU << RCC_VERR_MINREV_Pos)    /*!< 0x0000000F */
#define RCC_VERR_MINREV                       RCC_VERR_MINREV_Msk
#define RCC_VERR_MAJREV_Pos                   (4U)
#define RCC_VERR_MAJREV_Msk                   (0xFU << RCC_VERR_MAJREV_Pos)    /*!< 0x000000F0 */
#define RCC_VERR_MAJREV                       RCC_VERR_MAJREV_Msk

/*******************  Bit definition for RCC_IDR register ************/
/*!< This register gives the unique identifier of the RCC  */
#define RCC_VERR_ID_Pos                       (0U)
#define RCC_VERR_ID_Msk                       (0xFFFFFFFFU << RCC_VERR_ID_Pos) /*!< 0xFFFFFFFF */
#define RCC_VERR_ID                           RCC_VERR_ID_Msk

/*******************  Bit definition for RCC_IDR register ************/
/*!< This register gives the decoding space, which is for the RCC of 4 kB */
#define RCC_VERR_SIDR_Pos                     (0U)
#define RCC_VERR_SIDR_Msk                     (0xFFFFFFFFU << RCC_VERR_SIDR_Pos) /*!< 0xFFFFFFFF */
#define RCC_VERR_SIDR                         RCC_VERR_SIDR_Msk

/******************************************************************************/
/*                                                                            */
/*                                    RNG                                     */
/*                                                                            */
/******************************************************************************/
/********************  Bits definition for RNG_CR register  *******************/
#define RNG_CR_RNGEN_Pos    (2U)
#define RNG_CR_RNGEN_Msk    (0x1U << RNG_CR_RNGEN_Pos)                         /*!< 0x00000004 */
#define RNG_CR_RNGEN        RNG_CR_RNGEN_Msk
#define RNG_CR_IE_Pos       (3U)
#define RNG_CR_IE_Msk       (0x1U << RNG_CR_IE_Pos)                            /*!< 0x00000008 */
#define RNG_CR_IE           RNG_CR_IE_Msk
#define RNG_CR_CED_Pos      (5U)
#define RNG_CR_CED_Msk      (0x1U << RNG_CR_CED_Pos)                           /*!< 0x00000020 */
#define RNG_CR_CED          RNG_CR_CED_Msk

