STMicroelectronics/X-CUBE-NFC4/Drivers/CMSIS/Device/ST/STM32MP1xx/Include/stm32mp1xxxxx.h
/******************************* ADC VERSION ********************************/
#define ADC_VERSION(INSTANCE) ((INSTANCE)->VERR)

/******************************* DLYB VERSION ********************************/
#define DLYB_VERSION(INSTANCE) ((INSTANCE)->VERR)

/******************************* DAC VERSION ********************************/
#define DAC_VERSION(INSTANCE) ((INSTANCE)->IP_VER)

#if defined (STM32MP157Cxx) || defined (STM32MP157Fxx) || defined (STM32MP157Axx) || defined (STM32MP157Dxx)
/******************************* DSI VERSION ********************************/
#define DSI_VERSION(INSTANCE) ((INSTANCE)->VERR)
#endif

/******************************* USBPHYC VERSION ********************************/
#define USBPHYC_VERSION(INSTANCE) ((INSTANCE)->VERR)

/******************************* DEVICE VERSION ********************************/
#define DEVICE_REVISION() (((DBGMCU->IDCODE) & (DBGMCU_IDCODE_REV_ID_Msk)) >> DBGMCU_IDCODE_REV_ID_Pos)
#define IS_DEVICE_REV_B() (DEVICE_REVISION() == 0x2000)

/******************************* DEVICE ID  ************************************/
#define DEVICE_ID() ((DBGMCU->IDCODE) & (DBGMCU_IDCODE_DEV_ID_Msk))

/**
  * @brief  Check whether platform is engineering boot mode
  * @param  None 
  * @retval TRUE or FALSE
  */
#define IS_ENGINEERING_BOOT_MODE()   (((SYSCFG->BOOTR) & (SYSCFG_BOOTR_BOOT2|SYSCFG_BOOTR_BOOT1|SYSCFG_BOOTR_BOOT0)) == (SYSCFG_BOOTR_BOOT2))


 /**
  * @}
  */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif /* __cplusplus */

#endif /* __$PRODUCTNAME_UC$_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
